garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: DMAnCON1
#define DMAnCON1 DMAnCON1
extern volatile unsigned char           DMAnCON1            __at(0x055);
#ifndef _LIB_BUILD
asm("DMAnCON1 equ 055h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMAnCON1bits_t;
extern volatile DMAnCON1bits_t DMAnCON1bits __at(0x055);
// bitfield macros
#define _DMAnCON1_SSTP_POSN                                 0x0
#define _DMAnCON1_SSTP_POSITION                             0x0
#define _DMAnCON1_SSTP_SIZE                                 0x1
#define _DMAnCON1_SSTP_LENGTH                               0x1
#define _DMAnCON1_SSTP_MASK                                 0x1
#define _DMAnCON1_SMODE_POSN                                0x1
#define _DMAnCON1_SMODE_POSITION                            0x1
#define _DMAnCON1_SMODE_SIZE                                0x2
#define _DMAnCON1_SMODE_LENGTH                              0x2
#define _DMAnCON1_SMODE_MASK                                0x6
#define _DMAnCON1_SMR_POSN                                  0x3
#define _DMAnCON1_SMR_POSITION                              0x3
#define _DMAnCON1_SMR_SIZE                                  0x2
#define _DMAnCON1_SMR_LENGTH                                0x2
#define _DMAnCON1_SMR_MASK                                  0x18
#define _DMAnCON1_DSTP_POSN                                 0x5
#define _DMAnCON1_DSTP_POSITION                             0x5
#define _DMAnCON1_DSTP_SIZE                                 0x1
#define _DMAnCON1_DSTP_LENGTH                               0x1
#define _DMAnCON1_DSTP_MASK                                 0x20
#define _DMAnCON1_DMODE_POSN                                0x6
#define _DMAnCON1_DMODE_POSITION                            0x6
#define _DMAnCON1_DMODE_SIZE                                0x2
#define _DMAnCON1_DMODE_LENGTH                              0x2
#define _DMAnCON1_DMODE_MASK                                0xC0

// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
extern volatile unsigned char           DMAnAIRQ            __at(0x056);
#ifndef _LIB_BUILD
asm("DMAnAIRQ equ 056h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
        unsigned AIRQ7                  :1;
    };
} DMAnAIRQbits_t;
extern volatile DMAnAIRQbits_t DMAnAIRQbits __at(0x056);
// bitfield macros
#define _DMAnAIRQ_AIRQ_POSN                                 0x0
#define _DMAnAIRQ_AIRQ_POSITION                             0x0
#define _DMAnAIRQ_AIRQ_SIZE                                 0x8
#define _DMAnAIRQ_AIRQ_LENGTH                               0x8
#define _DMAnAIRQ_AIRQ_MASK                                 0xFF
#define _DMAnAIRQ_AIRQ0_POSN                                0x0
#define _DMAnAIRQ_AIRQ0_POSITION                            0x0
#define _DMAnAIRQ_AIRQ0_SIZE                                0x1
#define _DMAnAIRQ_AIRQ0_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ0_MASK                                0x1
#define _DMAnAIRQ_AIRQ1_POSN                                0x1
#define _DMAnAIRQ_AIRQ1_POSITION                            0x1
#define _DMAnAIRQ_AIRQ1_SIZE                                0x1
#define _DMAnAIRQ_AIRQ1_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ1_MASK                                0x2
#define _DMAnAIRQ_AIRQ2_POSN                                0x2
#define _DMAnAIRQ_AIRQ2_POSITION                            0x2
#define _DMAnAIRQ_AIRQ2_SIZE                                0x1
#define _DMAnAIRQ_AIRQ2_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ2_MASK                                0x4
#define _DMAnAIRQ_AIRQ3_POSN                                0x3
#define _DMAnAIRQ_AIRQ3_POSITION                            0x3
#define _DMAnAIRQ_AIRQ3_SIZE                                0x1
#define _DMAnAIRQ_AIRQ3_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ3_MASK                                0x8
#define _DMAnAIRQ_AIRQ4_POSN                                0x4
#define _DMAnAIRQ_AIRQ4_POSITION                            0x4
#define _DMAnAIRQ_AIRQ4_SIZE                                0x1
#define _DMAnAIRQ_AIRQ4_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ4_MASK                                0x10
#define _DMAnAIRQ_AIRQ5_POSN                                0x5
#define _DMAnAIRQ_AIRQ5_POSITION                            0x5
#define _DMAnAIRQ_AIRQ5_SIZE                                0x1
#define _DMAnAIRQ_AIRQ5_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ5_MASK                                0x20
#define _DMAnAIRQ_AIRQ6_POSN                                0x6
#define _DMAnAIRQ_AIRQ6_POSITION                            0x6
#define _DMAnAIRQ_AIRQ6_SIZE                                0x1
#define _DMAnAIRQ_AIRQ6_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ6_MASK                                0x40
#define _DMAnAIRQ_AIRQ7_POSN                                0x7
#define _DMAnAIRQ_AIRQ7_POSITION                            0x7
#define _DMAnAIRQ_AIRQ7_SIZE                                0x1
#define _DMAnAIRQ_AIRQ7_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ7_MASK                                0x80

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
extern volatile unsigned char           DMAnSIRQ            __at(0x057);
#ifndef _LIB_BUILD
asm("DMAnSIRQ equ 057h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
        unsigned SIRQ7                  :1;
    };
} DMAnSIRQbits_t;
