garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x07F);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 07Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :6;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
        unsigned TUN5                   :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0x07F);
// bitfield macros
#define _OSCTUNE_TUN_POSN                                   0x0
#define _OSCTUNE_TUN_POSITION                               0x0
#define _OSCTUNE_TUN_SIZE                                   0x6
#define _OSCTUNE_TUN_LENGTH                                 0x6
#define _OSCTUNE_TUN_MASK                                   0x3F
#define _OSCTUNE_TUN0_POSN                                  0x0
#define _OSCTUNE_TUN0_POSITION                              0x0
#define _OSCTUNE_TUN0_SIZE                                  0x1
#define _OSCTUNE_TUN0_LENGTH                                0x1
#define _OSCTUNE_TUN0_MASK                                  0x1
#define _OSCTUNE_TUN1_POSN                                  0x1
#define _OSCTUNE_TUN1_POSITION                              0x1
#define _OSCTUNE_TUN1_SIZE                                  0x1
#define _OSCTUNE_TUN1_LENGTH                                0x1
#define _OSCTUNE_TUN1_MASK                                  0x2
#define _OSCTUNE_TUN2_POSN                                  0x2
#define _OSCTUNE_TUN2_POSITION                              0x2
#define _OSCTUNE_TUN2_SIZE                                  0x1
#define _OSCTUNE_TUN2_LENGTH                                0x1
#define _OSCTUNE_TUN2_MASK                                  0x4
#define _OSCTUNE_TUN3_POSN                                  0x3
#define _OSCTUNE_TUN3_POSITION                              0x3
#define _OSCTUNE_TUN3_SIZE                                  0x1
#define _OSCTUNE_TUN3_LENGTH                                0x1
#define _OSCTUNE_TUN3_MASK                                  0x8
#define _OSCTUNE_TUN4_POSN                                  0x4
#define _OSCTUNE_TUN4_POSITION                              0x4
#define _OSCTUNE_TUN4_SIZE                                  0x1
#define _OSCTUNE_TUN4_LENGTH                                0x1
#define _OSCTUNE_TUN4_MASK                                  0x10
#define _OSCTUNE_TUN5_POSN                                  0x5
#define _OSCTUNE_TUN5_POSITION                              0x5
#define _OSCTUNE_TUN5_SIZE                                  0x1
#define _OSCTUNE_TUN5_LENGTH                                0x1
#define _OSCTUNE_TUN5_MASK                                  0x20

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
extern volatile unsigned char           OSCFRQ              __at(0x080);
#ifndef _LIB_BUILD
asm("OSCFRQ equ 080h");
#endif
// aliases
extern volatile unsigned char           OSCFREQ             __at(0x080);
#ifndef _LIB_BUILD
asm("OSCFREQ equ 080h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FRQ                    :4;
    };
    struct {
        unsigned FRQ0                   :1;
        unsigned FRQ1                   :1;
        unsigned FRQ2                   :1;
        unsigned FRQ3                   :1;
    };
} OSCFRQbits_t;
extern volatile OSCFRQbits_t OSCFRQbits __at(0x080);
// bitfield macros
#define _OSCFRQ_FRQ_POSN                                    0x0
#define _OSCFRQ_FRQ_POSITION                                0x0
#define _OSCFRQ_FRQ_SIZE                                    0x4
#define _OSCFRQ_FRQ_LENGTH                                  0x4
#define _OSCFRQ_FRQ_MASK                                    0xF
#define _OSCFRQ_FRQ0_POSN                                   0x0
#define _OSCFRQ_FRQ0_POSITION                               0x0
#define _OSCFRQ_FRQ0_SIZE                                   0x1
#define _OSCFRQ_FRQ0_LENGTH                                 0x1
#define _OSCFRQ_FRQ0_MASK                                   0x1
#define _OSCFRQ_FRQ1_POSN                                   0x1
#define _OSCFRQ_FRQ1_POSITION                               0x1
#define _OSCFRQ_FRQ1_SIZE                                   0x1
#define _OSCFRQ_FRQ1_LENGTH                                 0x1
#define _OSCFRQ_FRQ1_MASK                                   0x2
#define _OSCFRQ_FRQ2_POSN                                   0x2
#define _OSCFRQ_FRQ2_POSITION                               0x2
#define _OSCFRQ_FRQ2_SIZE                                   0x1
#define _OSCFRQ_FRQ2_LENGTH                                 0x1
#define _OSCFRQ_FRQ2_MASK                                   0x4
#define _OSCFRQ_FRQ3_POSN                                   0x3
#define _OSCFRQ_FRQ3_POSITION                               0x3
#define _OSCFRQ_FRQ3_SIZE                                   0x1
#define _OSCFRQ_FRQ3_LENGTH                                 0x1
#define _OSCFRQ_FRQ3_MASK                                   0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned FRQ                    :4;
    };
    struct {
        unsigned FRQ0                   :1;
        unsigned FRQ1                   :1;
        unsigned FRQ2                   :1;
        unsigned FRQ3                   :1;
    };
} OSCFREQbits_t;
extern volatile OSCFREQbits_t OSCFREQbits __at(0x080);
// bitfield macros
#define _OSCFREQ_FRQ_POSN                                   0x0
#define _OSCFREQ_FRQ_POSITION                               0x0
#define _OSCFREQ_FRQ_SIZE                                   0x4
#define _OSCFREQ_FRQ_LENGTH                                 0x4
#define _OSCFREQ_FRQ_MASK                                   0xF
#define _OSCFREQ_FRQ0_POSN                                  0x0
#define _OSCFREQ_FRQ0_POSITION                              0x0
#define _OSCFREQ_FRQ0_SIZE                                  0x1
#define _OSCFREQ_FRQ0_LENGTH                                0x1
#define _OSCFREQ_FRQ0_MASK                                  0x1
#define _OSCFREQ_FRQ1_POSN                                  0x1
#define _OSCFREQ_FRQ1_POSITION                              0x1
#define _OSCFREQ_FRQ1_SIZE                                  0x1
#define _OSCFREQ_FRQ1_LENGTH                                0x1
#define _OSCFREQ_FRQ1_MASK                                  0x2
#define _OSCFREQ_FRQ2_POSN                                  0x2
#define _OSCFREQ_FRQ2_POSITION                              0x2
#define _OSCFREQ_FRQ2_SIZE                                  0x1
#define _OSCFREQ_FRQ2_LENGTH                                0x1
#define _OSCFREQ_FRQ2_MASK                                  0x4
#define _OSCFREQ_FRQ3_POSN                                  0x3
#define _OSCFREQ_FRQ3_POSITION                              0x3
#define _OSCFREQ_FRQ3_SIZE                                  0x1
#define _OSCFREQ_FRQ3_LENGTH                                0x1
#define _OSCFREQ_FRQ3_MASK                                  0x8

// Register: ACTCON
#define ACTCON ACTCON
extern volatile unsigned char           ACTCON              __at(0x081);
#ifndef _LIB_BUILD
asm("ACTCON equ 081h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ORS                    :1;
        unsigned                        :1;
        unsigned LOCK                   :1;
        unsigned                        :2;
        unsigned UD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :1;
        unsigned ACTORS                 :1;
        unsigned                        :1;
        unsigned ACTLOCK                :1;
        unsigned                        :2;
        unsigned ACTUD                  :1;
        unsigned ACTEN                  :1;
    };
} ACTCONbits_t;
extern volatile ACTCONbits_t ACTCONbits __at(0x081);
// bitfield macros
#define _ACTCON_ORS_POSN                                    0x1
#define _ACTCON_ORS_POSITION                                0x1
#define _ACTCON_ORS_SIZE                                    0x1
#define _ACTCON_ORS_LENGTH                                  0x1
#define _ACTCON_ORS_MASK                                    0x2
#define _ACTCON_LOCK_POSN                                   0x3
#define _ACTCON_LOCK_POSITION                               0x3
#define _ACTCON_LOCK_SIZE                                   0x1
#define _ACTCON_LOCK_LENGTH                                 0x1
#define _ACTCON_LOCK_MASK                                   0x8
#define _ACTCON_UD_POSN                                     0x6
#define _ACTCON_UD_POSITION                                 0x6
#define _ACTCON_UD_SIZE                                     0x1
#define _ACTCON_UD_LENGTH                                   0x1
#define _ACTCON_UD_MASK                                     0x40
#define _ACTCON_EN_POSN                                     0x7
#define _ACTCON_EN_POSITION                                 0x7
#define _ACTCON_EN_SIZE                                     0x1
#define _ACTCON_EN_LENGTH                                   0x1
#define _ACTCON_EN_MASK                                     0x80
#define _ACTCON_ACTORS_POSN                                 0x1
#define _ACTCON_ACTORS_POSITION                             0x1
#define _ACTCON_ACTORS_SIZE                                 0x1
#define _ACTCON_ACTORS_LENGTH                               0x1
#define _ACTCON_ACTORS_MASK                                 0x2
#define _ACTCON_ACTLOCK_POSN                                0x3
#define _ACTCON_ACTLOCK_POSITION                            0x3
#define _ACTCON_ACTLOCK_SIZE                                0x1
#define _ACTCON_ACTLOCK_LENGTH                              0x1
#define _ACTCON_ACTLOCK_MASK                                0x8
#define _ACTCON_ACTUD_POSN                                  0x6
#define _ACTCON_ACTUD_POSITION                              0x6
#define _ACTCON_ACTUD_SIZE                                  0x1
#define _ACTCON_ACTUD_LENGTH                                0x1
#define _ACTCON_ACTUD_MASK                                  0x40
#define _ACTCON_ACTEN_POSN                                  0x7
#define _ACTCON_ACTEN_POSITION                              0x7
#define _ACTCON_ACTEN_SIZE                                  0x1
#define _ACTCON_ACTEN_LENGTH                                0x1
#define _ACTCON_ACTEN_MASK                                  0x80

// Register: FSCMCON
#define FSCMCON FSCMCON
extern volatile unsigned char           FSCMCON             __at(0x082);
#ifndef _LIB_BUILD
asm("FSCMCON equ 082h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSCMFEV                :1;
        unsigned FSCMFFI                :1;
        unsigned FSCMPEV                :1;
        unsigned FSCMPFI                :1;
        unsigned FSCMSEV                :1;
        unsigned FSCMSFI                :1;
    };
} FSCMCONbits_t;
extern volatile FSCMCONbits_t FSCMCONbits __at(0x082);
// bitfield macros
#define _FSCMCON_FSCMFEV_POSN                               0x0
#define _FSCMCON_FSCMFEV_POSITION                           0x0
#define _FSCMCON_FSCMFEV_SIZE                               0x1
#define _FSCMCON_FSCMFEV_LENGTH                             0x1
#define _FSCMCON_FSCMFEV_MASK                               0x1
#define _FSCMCON_FSCMFFI_POSN                               0x1
#define _FSCMCON_FSCMFFI_POSITION                           0x1
#define _FSCMCON_FSCMFFI_SIZE                               0x1
#define _FSCMCON_FSCMFFI_LENGTH                             0x1
#define _FSCMCON_FSCMFFI_MASK                               0x2
#define _FSCMCON_FSCMPEV_POSN                               0x2
#define _FSCMCON_FSCMPEV_POSITION                           0x2
#define _FSCMCON_FSCMPEV_SIZE                               0x1
#define _FSCMCON_FSCMPEV_LENGTH                             0x1
#define _FSCMCON_FSCMPEV_MASK                               0x4
#define _FSCMCON_FSCMPFI_POSN                               0x3
#define _FSCMCON_FSCMPFI_POSITION                           0x3
#define _FSCMCON_FSCMPFI_SIZE                               0x1
#define _FSCMCON_FSCMPFI_LENGTH                             0x1
#define _FSCMCON_FSCMPFI_MASK                               0x8
#define _FSCMCON_FSCMSEV_POSN                               0x4
#define _FSCMCON_FSCMSEV_POSITION                           0x4
#define _FSCMCON_FSCMSEV_SIZE                               0x1
#define _FSCMCON_FSCMSEV_LENGTH                             0x1
#define _FSCMCON_FSCMSEV_MASK                               0x10
#define _FSCMCON_FSCMSFI_POSN                               0x5
#define _FSCMCON_FSCMSFI_POSITION                           0x5
#define _FSCMCON_FSCMSFI_SIZE                               0x1
#define _FSCMCON_FSCMSFI_LENGTH                             0x1
#define _FSCMCON_FSCMSFI_MASK                               0x20

