garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: I3C1DCR
#define I3C1DCR I3C1DCR
extern volatile unsigned char           I3C1DCR             __at(0x0A9);
#ifndef _LIB_BUILD
asm("I3C1DCR equ 0A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCR                    :8;
    };
} I3C1DCRbits_t;
extern volatile I3C1DCRbits_t I3C1DCRbits __at(0x0A9);
// bitfield macros
#define _I3C1DCR_DCR_POSN                                   0x0
#define _I3C1DCR_DCR_POSITION                               0x0
#define _I3C1DCR_DCR_SIZE                                   0x8
#define _I3C1DCR_DCR_LENGTH                                 0x8
#define _I3C1DCR_DCR_MASK                                   0xFF

// Register: I3C1DSTAT0
#define I3C1DSTAT0 I3C1DSTAT0
extern volatile unsigned char           I3C1DSTAT0          __at(0x0AA);
#ifndef _LIB_BUILD
asm("I3C1DSTAT0 equ 0AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPEND                :4;
        unsigned                        :1;
        unsigned PERR                   :1;
        unsigned ACTMODE                :2;
    };
    struct {
        unsigned INPEND0                :1;
        unsigned INTPEND1               :1;
        unsigned INTPEND2               :1;
        unsigned INTPEND3               :1;
        unsigned                        :2;
        unsigned ACTMODE0               :1;
        unsigned ACTMODE1               :1;
    };
} I3C1DSTAT0bits_t;
extern volatile I3C1DSTAT0bits_t I3C1DSTAT0bits __at(0x0AA);
// bitfield macros
#define _I3C1DSTAT0_INTPEND_POSN                            0x0
#define _I3C1DSTAT0_INTPEND_POSITION                        0x0
#define _I3C1DSTAT0_INTPEND_SIZE                            0x4
#define _I3C1DSTAT0_INTPEND_LENGTH                          0x4
#define _I3C1DSTAT0_INTPEND_MASK                            0xF
#define _I3C1DSTAT0_PERR_POSN                               0x5
#define _I3C1DSTAT0_PERR_POSITION                           0x5
#define _I3C1DSTAT0_PERR_SIZE                               0x1
#define _I3C1DSTAT0_PERR_LENGTH                             0x1
#define _I3C1DSTAT0_PERR_MASK                               0x20
#define _I3C1DSTAT0_ACTMODE_POSN                            0x6
#define _I3C1DSTAT0_ACTMODE_POSITION                        0x6
#define _I3C1DSTAT0_ACTMODE_SIZE                            0x2
#define _I3C1DSTAT0_ACTMODE_LENGTH                          0x2
#define _I3C1DSTAT0_ACTMODE_MASK                            0xC0
#define _I3C1DSTAT0_INPEND0_POSN                            0x0
#define _I3C1DSTAT0_INPEND0_POSITION                        0x0
#define _I3C1DSTAT0_INPEND0_SIZE                            0x1
#define _I3C1DSTAT0_INPEND0_LENGTH                          0x1
#define _I3C1DSTAT0_INPEND0_MASK                            0x1
#define _I3C1DSTAT0_INTPEND1_POSN                           0x1
#define _I3C1DSTAT0_INTPEND1_POSITION                       0x1
#define _I3C1DSTAT0_INTPEND1_SIZE                           0x1
#define _I3C1DSTAT0_INTPEND1_LENGTH                         0x1
#define _I3C1DSTAT0_INTPEND1_MASK                           0x2
#define _I3C1DSTAT0_INTPEND2_POSN                           0x2
#define _I3C1DSTAT0_INTPEND2_POSITION                       0x2
#define _I3C1DSTAT0_INTPEND2_SIZE                           0x1
#define _I3C1DSTAT0_INTPEND2_LENGTH                         0x1
#define _I3C1DSTAT0_INTPEND2_MASK                           0x4
#define _I3C1DSTAT0_INTPEND3_POSN                           0x3
#define _I3C1DSTAT0_INTPEND3_POSITION                       0x3
#define _I3C1DSTAT0_INTPEND3_SIZE                           0x1
#define _I3C1DSTAT0_INTPEND3_LENGTH                         0x1
#define _I3C1DSTAT0_INTPEND3_MASK                           0x8
#define _I3C1DSTAT0_ACTMODE0_POSN                           0x6
#define _I3C1DSTAT0_ACTMODE0_POSITION                       0x6
#define _I3C1DSTAT0_ACTMODE0_SIZE                           0x1
#define _I3C1DSTAT0_ACTMODE0_LENGTH                         0x1
#define _I3C1DSTAT0_ACTMODE0_MASK                           0x40
#define _I3C1DSTAT0_ACTMODE1_POSN                           0x7
#define _I3C1DSTAT0_ACTMODE1_POSITION                       0x7
#define _I3C1DSTAT0_ACTMODE1_SIZE                           0x1
#define _I3C1DSTAT0_ACTMODE1_LENGTH                         0x1
#define _I3C1DSTAT0_ACTMODE1_MASK                           0x80

// Register: I3C1DSTAT1
#define I3C1DSTAT1 I3C1DSTAT1
extern volatile unsigned char           I3C1DSTAT1          __at(0x0AB);
#ifndef _LIB_BUILD
asm("I3C1DSTAT1 equ 0ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VRSV                   :8;
    };
    struct {
        unsigned VRSV0                  :1;
        unsigned VRSV1                  :1;
        unsigned VRSV2                  :1;
        unsigned VRSV3                  :1;
        unsigned VRSV4                  :1;
        unsigned VRSV5                  :1;
        unsigned VRSV6                  :1;
        unsigned VRSV7                  :1;
    };
} I3C1DSTAT1bits_t;
extern volatile I3C1DSTAT1bits_t I3C1DSTAT1bits __at(0x0AB);
// bitfield macros
#define _I3C1DSTAT1_VRSV_POSN                               0x0
#define _I3C1DSTAT1_VRSV_POSITION                           0x0
#define _I3C1DSTAT1_VRSV_SIZE                               0x8
#define _I3C1DSTAT1_VRSV_LENGTH                             0x8
#define _I3C1DSTAT1_VRSV_MASK                               0xFF
#define _I3C1DSTAT1_VRSV0_POSN                              0x0
#define _I3C1DSTAT1_VRSV0_POSITION                          0x0
#define _I3C1DSTAT1_VRSV0_SIZE                              0x1
#define _I3C1DSTAT1_VRSV0_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV0_MASK                              0x1
#define _I3C1DSTAT1_VRSV1_POSN                              0x1
#define _I3C1DSTAT1_VRSV1_POSITION                          0x1
#define _I3C1DSTAT1_VRSV1_SIZE                              0x1
#define _I3C1DSTAT1_VRSV1_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV1_MASK                              0x2
#define _I3C1DSTAT1_VRSV2_POSN                              0x2
#define _I3C1DSTAT1_VRSV2_POSITION                          0x2
#define _I3C1DSTAT1_VRSV2_SIZE                              0x1
#define _I3C1DSTAT1_VRSV2_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV2_MASK                              0x4
#define _I3C1DSTAT1_VRSV3_POSN                              0x3
#define _I3C1DSTAT1_VRSV3_POSITION                          0x3
#define _I3C1DSTAT1_VRSV3_SIZE                              0x1
#define _I3C1DSTAT1_VRSV3_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV3_MASK                              0x8
#define _I3C1DSTAT1_VRSV4_POSN                              0x4
#define _I3C1DSTAT1_VRSV4_POSITION                          0x4
#define _I3C1DSTAT1_VRSV4_SIZE                              0x1
#define _I3C1DSTAT1_VRSV4_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV4_MASK                              0x10
#define _I3C1DSTAT1_VRSV5_POSN                              0x5
#define _I3C1DSTAT1_VRSV5_POSITION                          0x5
#define _I3C1DSTAT1_VRSV5_SIZE                              0x1
#define _I3C1DSTAT1_VRSV5_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV5_MASK                              0x20
#define _I3C1DSTAT1_VRSV6_POSN                              0x6
#define _I3C1DSTAT1_VRSV6_POSITION                          0x6
#define _I3C1DSTAT1_VRSV6_SIZE                              0x1
#define _I3C1DSTAT1_VRSV6_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV6_MASK                              0x40
#define _I3C1DSTAT1_VRSV7_POSN                              0x7
#define _I3C1DSTAT1_VRSV7_POSITION                          0x7
#define _I3C1DSTAT1_VRSV7_SIZE                              0x1
#define _I3C1DSTAT1_VRSV7_LENGTH                            0x1
#define _I3C1DSTAT1_VRSV7_MASK                              0x80

