garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
extern volatile TU16ACRHbits_t TU16ACRHbits __at(0x131);
// bitfield macros
#define _TU16ACRH_CRH_POSN                                  0x0
#define _TU16ACRH_CRH_POSITION                              0x0
#define _TU16ACRH_CRH_SIZE                                  0x8
#define _TU16ACRH_CRH_LENGTH                                0x8
#define _TU16ACRH_CRH_MASK                                  0xFF
#define _TU16ACRH_CRH0_POSN                                 0x0
#define _TU16ACRH_CRH0_POSITION                             0x0
#define _TU16ACRH_CRH0_SIZE                                 0x1
#define _TU16ACRH_CRH0_LENGTH                               0x1
#define _TU16ACRH_CRH0_MASK                                 0x1
#define _TU16ACRH_CRH1_POSN                                 0x1
#define _TU16ACRH_CRH1_POSITION                             0x1
#define _TU16ACRH_CRH1_SIZE                                 0x1
#define _TU16ACRH_CRH1_LENGTH                               0x1
#define _TU16ACRH_CRH1_MASK                                 0x2
#define _TU16ACRH_CRH2_POSN                                 0x2
#define _TU16ACRH_CRH2_POSITION                             0x2
#define _TU16ACRH_CRH2_SIZE                                 0x1
#define _TU16ACRH_CRH2_LENGTH                               0x1
#define _TU16ACRH_CRH2_MASK                                 0x4
#define _TU16ACRH_CRH3_POSN                                 0x3
#define _TU16ACRH_CRH3_POSITION                             0x3
#define _TU16ACRH_CRH3_SIZE                                 0x1
#define _TU16ACRH_CRH3_LENGTH                               0x1
#define _TU16ACRH_CRH3_MASK                                 0x8
#define _TU16ACRH_CRH4_POSN                                 0x4
#define _TU16ACRH_CRH4_POSITION                             0x4
#define _TU16ACRH_CRH4_SIZE                                 0x1
#define _TU16ACRH_CRH4_LENGTH                               0x1
#define _TU16ACRH_CRH4_MASK                                 0x10
#define _TU16ACRH_CRH5_POSN                                 0x5
#define _TU16ACRH_CRH5_POSITION                             0x5
#define _TU16ACRH_CRH5_SIZE                                 0x1
#define _TU16ACRH_CRH5_LENGTH                               0x1
#define _TU16ACRH_CRH5_MASK                                 0x20
#define _TU16ACRH_CRH6_POSN                                 0x6
#define _TU16ACRH_CRH6_POSITION                             0x6
#define _TU16ACRH_CRH6_SIZE                                 0x1
#define _TU16ACRH_CRH6_LENGTH                               0x1
#define _TU16ACRH_CRH6_MASK                                 0x40
#define _TU16ACRH_CRH7_POSN                                 0x7
#define _TU16ACRH_CRH7_POSITION                             0x7
#define _TU16ACRH_CRH7_SIZE                                 0x1
#define _TU16ACRH_CRH7_LENGTH                               0x1
#define _TU16ACRH_CRH7_MASK                                 0x80
#define _TU16ACRH_TU16ACRH0_POSN                            0x0
#define _TU16ACRH_TU16ACRH0_POSITION                        0x0
#define _TU16ACRH_TU16ACRH0_SIZE                            0x1
#define _TU16ACRH_TU16ACRH0_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH0_MASK                            0x1
#define _TU16ACRH_TU16ACRH1_POSN                            0x1
#define _TU16ACRH_TU16ACRH1_POSITION                        0x1
#define _TU16ACRH_TU16ACRH1_SIZE                            0x1
#define _TU16ACRH_TU16ACRH1_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH1_MASK                            0x2
#define _TU16ACRH_TU16ACRH2_POSN                            0x2
#define _TU16ACRH_TU16ACRH2_POSITION                        0x2
#define _TU16ACRH_TU16ACRH2_SIZE                            0x1
#define _TU16ACRH_TU16ACRH2_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH2_MASK                            0x4
#define _TU16ACRH_TU16ACRH3_POSN                            0x3
#define _TU16ACRH_TU16ACRH3_POSITION                        0x3
#define _TU16ACRH_TU16ACRH3_SIZE                            0x1
#define _TU16ACRH_TU16ACRH3_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH3_MASK                            0x8
#define _TU16ACRH_TU16ACRH4_POSN                            0x4
#define _TU16ACRH_TU16ACRH4_POSITION                        0x4
#define _TU16ACRH_TU16ACRH4_SIZE                            0x1
#define _TU16ACRH_TU16ACRH4_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH4_MASK                            0x10
#define _TU16ACRH_TU16ACRH5_POSN                            0x5
#define _TU16ACRH_TU16ACRH5_POSITION                        0x5
#define _TU16ACRH_TU16ACRH5_SIZE                            0x1
#define _TU16ACRH_TU16ACRH5_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH5_MASK                            0x20
#define _TU16ACRH_TU16ACRH6_POSN                            0x6
#define _TU16ACRH_TU16ACRH6_POSITION                        0x6
#define _TU16ACRH_TU16ACRH6_SIZE                            0x1
#define _TU16ACRH_TU16ACRH6_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH6_MASK                            0x40
#define _TU16ACRH_TU16ACRH7_POSN                            0x7
#define _TU16ACRH_TU16ACRH7_POSITION                        0x7
#define _TU16ACRH_TU16ACRH7_SIZE                            0x1
#define _TU16ACRH_TU16ACRH7_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH7_MASK                            0x80
#define _TU16ACRH_TU16ACR8_POSN                             0x0
#define _TU16ACRH_TU16ACR8_POSITION                         0x0
#define _TU16ACRH_TU16ACR8_SIZE                             0x1
#define _TU16ACRH_TU16ACR8_LENGTH                           0x1
#define _TU16ACRH_TU16ACR8_MASK                             0x1
#define _TU16ACRH_TU16ACR9_POSN                             0x1
#define _TU16ACRH_TU16ACR9_POSITION                         0x1
#define _TU16ACRH_TU16ACR9_SIZE                             0x1
#define _TU16ACRH_TU16ACR9_LENGTH                           0x1
#define _TU16ACRH_TU16ACR9_MASK                             0x2
#define _TU16ACRH_TU16ACR10_POSN                            0x2
#define _TU16ACRH_TU16ACR10_POSITION                        0x2
#define _TU16ACRH_TU16ACR10_SIZE                            0x1
#define _TU16ACRH_TU16ACR10_LENGTH                          0x1
#define _TU16ACRH_TU16ACR10_MASK                            0x4
#define _TU16ACRH_TU16ACR11_POSN                            0x3
#define _TU16ACRH_TU16ACR11_POSITION                        0x3
#define _TU16ACRH_TU16ACR11_SIZE                            0x1
#define _TU16ACRH_TU16ACR11_LENGTH                          0x1
#define _TU16ACRH_TU16ACR11_MASK                            0x8
#define _TU16ACRH_TU16ACR12_POSN                            0x4
#define _TU16ACRH_TU16ACR12_POSITION                        0x4
#define _TU16ACRH_TU16ACR12_SIZE                            0x1
#define _TU16ACRH_TU16ACR12_LENGTH                          0x1
#define _TU16ACRH_TU16ACR12_MASK                            0x10
#define _TU16ACRH_TU16ACR13_POSN                            0x5
#define _TU16ACRH_TU16ACR13_POSITION                        0x5
#define _TU16ACRH_TU16ACR13_SIZE                            0x1
#define _TU16ACRH_TU16ACR13_LENGTH                          0x1
#define _TU16ACRH_TU16ACR13_MASK                            0x20
#define _TU16ACRH_TU16ACR14_POSN                            0x6
#define _TU16ACRH_TU16ACR14_POSITION                        0x6
#define _TU16ACRH_TU16ACR14_SIZE                            0x1
#define _TU16ACRH_TU16ACR14_LENGTH                          0x1
#define _TU16ACRH_TU16ACR14_MASK                            0x40
#define _TU16ACRH_TU16ACR15_POSN                            0x7
#define _TU16ACRH_TU16ACR15_POSITION                        0x7
#define _TU16ACRH_TU16ACR15_SIZE                            0x1
#define _TU16ACRH_TU16ACR15_LENGTH                          0x1
#define _TU16ACRH_TU16ACR15_MASK                            0x80

// Register: TU16ATMRT
#define TU16ATMRT TU16ATMRT
extern volatile unsigned char           TU16ATMRT           __at(0x133);
#ifndef _LIB_BUILD
asm("TU16ATMRT equ 0133h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMRT                   :8;
    };
    struct {
        unsigned TMRT0                  :1;
        unsigned TMRT1                  :1;
        unsigned TMRT2                  :1;
        unsigned TMRT3                  :1;
        unsigned TMRT4                  :1;
        unsigned TMRT5                  :1;
        unsigned TMRT6                  :1;
        unsigned TMRT7                  :1;
    };
    struct {
        unsigned TU16ATMRT0             :1;
        unsigned TU16ATMRT1             :1;
        unsigned TU16ATMRT2             :1;
        unsigned TU16ATMRT3             :1;
        unsigned TU16ATMRT4             :1;
        unsigned TU16ATMRT5             :1;
        unsigned TU16ATMRT6             :1;
        unsigned TU16ATMRT7             :1;
    };
    struct {
        unsigned TU16ATMR24             :1;
        unsigned TU16ATMR25             :1;
        unsigned TU16ATMR26             :1;
        unsigned TU16ATMR27             :1;
        unsigned TU16ATMR28             :1;
        unsigned TU16ATMR29             :1;
        unsigned TU16ATMR30             :1;
        unsigned TU16ATMR31             :1;
    };
} TU16ATMRTbits_t;
extern volatile TU16ATMRTbits_t TU16ATMRTbits __at(0x133);
// bitfield macros
#define _TU16ATMRT_TMRT_POSN                                0x0
#define _TU16ATMRT_TMRT_POSITION                            0x0
#define _TU16ATMRT_TMRT_SIZE                                0x8
#define _TU16ATMRT_TMRT_LENGTH                              0x8
#define _TU16ATMRT_TMRT_MASK                                0xFF
#define _TU16ATMRT_TMRT0_POSN                               0x0
#define _TU16ATMRT_TMRT0_POSITION                           0x0
#define _TU16ATMRT_TMRT0_SIZE                               0x1
#define _TU16ATMRT_TMRT0_LENGTH                             0x1
#define _TU16ATMRT_TMRT0_MASK                               0x1
#define _TU16ATMRT_TMRT1_POSN                               0x1
#define _TU16ATMRT_TMRT1_POSITION                           0x1
#define _TU16ATMRT_TMRT1_SIZE                               0x1
#define _TU16ATMRT_TMRT1_LENGTH                             0x1
#define _TU16ATMRT_TMRT1_MASK                               0x2
#define _TU16ATMRT_TMRT2_POSN                               0x2
#define _TU16ATMRT_TMRT2_POSITION                           0x2
#define _TU16ATMRT_TMRT2_SIZE                               0x1
#define _TU16ATMRT_TMRT2_LENGTH                             0x1
#define _TU16ATMRT_TMRT2_MASK                               0x4
#define _TU16ATMRT_TMRT3_POSN                               0x3
#define _TU16ATMRT_TMRT3_POSITION                           0x3
#define _TU16ATMRT_TMRT3_SIZE                               0x1
#define _TU16ATMRT_TMRT3_LENGTH                             0x1
#define _TU16ATMRT_TMRT3_MASK                               0x8
#define _TU16ATMRT_TMRT4_POSN                               0x4
#define _TU16ATMRT_TMRT4_POSITION                           0x4
#define _TU16ATMRT_TMRT4_SIZE                               0x1
#define _TU16ATMRT_TMRT4_LENGTH                             0x1
#define _TU16ATMRT_TMRT4_MASK                               0x10
#define _TU16ATMRT_TMRT5_POSN                               0x5
#define _TU16ATMRT_TMRT5_POSITION                           0x5
#define _TU16ATMRT_TMRT5_SIZE                               0x1
#define _TU16ATMRT_TMRT5_LENGTH                             0x1
#define _TU16ATMRT_TMRT5_MASK                               0x20
#define _TU16ATMRT_TMRT6_POSN                               0x6
#define _TU16ATMRT_TMRT6_POSITION                           0x6
#define _TU16ATMRT_TMRT6_SIZE                               0x1
#define _TU16ATMRT_TMRT6_LENGTH                             0x1
#define _TU16ATMRT_TMRT6_MASK                               0x40
#define _TU16ATMRT_TMRT7_POSN                               0x7
#define _TU16ATMRT_TMRT7_POSITION                           0x7
#define _TU16ATMRT_TMRT7_SIZE                               0x1
#define _TU16ATMRT_TMRT7_LENGTH                             0x1
#define _TU16ATMRT_TMRT7_MASK                               0x80
#define _TU16ATMRT_TU16ATMRT0_POSN                          0x0
#define _TU16ATMRT_TU16ATMRT0_POSITION                      0x0
#define _TU16ATMRT_TU16ATMRT0_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT0_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT0_MASK                          0x1
#define _TU16ATMRT_TU16ATMRT1_POSN                          0x1
#define _TU16ATMRT_TU16ATMRT1_POSITION                      0x1
#define _TU16ATMRT_TU16ATMRT1_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT1_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT1_MASK                          0x2
#define _TU16ATMRT_TU16ATMRT2_POSN                          0x2
#define _TU16ATMRT_TU16ATMRT2_POSITION                      0x2
#define _TU16ATMRT_TU16ATMRT2_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT2_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT2_MASK                          0x4
#define _TU16ATMRT_TU16ATMRT3_POSN                          0x3
#define _TU16ATMRT_TU16ATMRT3_POSITION                      0x3
#define _TU16ATMRT_TU16ATMRT3_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT3_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT3_MASK                          0x8
#define _TU16ATMRT_TU16ATMRT4_POSN                          0x4
#define _TU16ATMRT_TU16ATMRT4_POSITION                      0x4
#define _TU16ATMRT_TU16ATMRT4_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT4_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT4_MASK                          0x10
#define _TU16ATMRT_TU16ATMRT5_POSN                          0x5
#define _TU16ATMRT_TU16ATMRT5_POSITION                      0x5
#define _TU16ATMRT_TU16ATMRT5_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT5_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT5_MASK                          0x20
#define _TU16ATMRT_TU16ATMRT6_POSN                          0x6
#define _TU16ATMRT_TU16ATMRT6_POSITION                      0x6
#define _TU16ATMRT_TU16ATMRT6_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT6_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT6_MASK                          0x40
#define _TU16ATMRT_TU16ATMRT7_POSN                          0x7
#define _TU16ATMRT_TU16ATMRT7_POSITION                      0x7
#define _TU16ATMRT_TU16ATMRT7_SIZE                          0x1
#define _TU16ATMRT_TU16ATMRT7_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMRT7_MASK                          0x80
#define _TU16ATMRT_TU16ATMR24_POSN                          0x0
#define _TU16ATMRT_TU16ATMR24_POSITION                      0x0
#define _TU16ATMRT_TU16ATMR24_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR24_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR24_MASK                          0x1
#define _TU16ATMRT_TU16ATMR25_POSN                          0x1
#define _TU16ATMRT_TU16ATMR25_POSITION                      0x1
#define _TU16ATMRT_TU16ATMR25_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR25_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR25_MASK                          0x2
#define _TU16ATMRT_TU16ATMR26_POSN                          0x2
#define _TU16ATMRT_TU16ATMR26_POSITION                      0x2
#define _TU16ATMRT_TU16ATMR26_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR26_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR26_MASK                          0x4
#define _TU16ATMRT_TU16ATMR27_POSN                          0x3
#define _TU16ATMRT_TU16ATMR27_POSITION                      0x3
#define _TU16ATMRT_TU16ATMR27_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR27_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR27_MASK                          0x8
#define _TU16ATMRT_TU16ATMR28_POSN                          0x4
#define _TU16ATMRT_TU16ATMR28_POSITION                      0x4
#define _TU16ATMRT_TU16ATMR28_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR28_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR28_MASK                          0x10
#define _TU16ATMRT_TU16ATMR29_POSN                          0x5
#define _TU16ATMRT_TU16ATMR29_POSITION                      0x5
#define _TU16ATMRT_TU16ATMR29_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR29_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR29_MASK                          0x20
#define _TU16ATMRT_TU16ATMR30_POSN                          0x6
#define _TU16ATMRT_TU16ATMR30_POSITION                      0x6
#define _TU16ATMRT_TU16ATMR30_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR30_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR30_MASK                          0x40
#define _TU16ATMRT_TU16ATMR31_POSN                          0x7
#define _TU16ATMRT_TU16ATMR31_POSITION                      0x7
#define _TU16ATMRT_TU16ATMR31_SIZE                          0x1
#define _TU16ATMRT_TU16ATMR31_LENGTH                        0x1
#define _TU16ATMRT_TU16ATMR31_MASK                          0x80

