garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: I2C1PIE
#define I2C1PIE I2C1PIE
extern volatile unsigned char           I2C1PIE             __at(0x1EB);
#ifndef _LIB_BUILD
asm("I2C1PIE equ 01EBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC1IE                  :1;
        unsigned RSC1IE                 :1;
        unsigned PC1IE                  :1;
        unsigned ADR1IE                 :1;
        unsigned WR1IE                  :1;
        unsigned                        :1;
        unsigned ACKT1IE                :1;
        unsigned CNT1IE                 :1;
    };
} I2C1PIEbits_t;
extern volatile I2C1PIEbits_t I2C1PIEbits __at(0x1EB);
// bitfield macros
#define _I2C1PIE_SCIE_POSN                                  0x0
#define _I2C1PIE_SCIE_POSITION                              0x0
#define _I2C1PIE_SCIE_SIZE                                  0x1
#define _I2C1PIE_SCIE_LENGTH                                0x1
#define _I2C1PIE_SCIE_MASK                                  0x1
#define _I2C1PIE_RSCIE_POSN                                 0x1
#define _I2C1PIE_RSCIE_POSITION                             0x1
#define _I2C1PIE_RSCIE_SIZE                                 0x1
#define _I2C1PIE_RSCIE_LENGTH                               0x1
#define _I2C1PIE_RSCIE_MASK                                 0x2
#define _I2C1PIE_PCIE_POSN                                  0x2
#define _I2C1PIE_PCIE_POSITION                              0x2
#define _I2C1PIE_PCIE_SIZE                                  0x1
#define _I2C1PIE_PCIE_LENGTH                                0x1
#define _I2C1PIE_PCIE_MASK                                  0x4
#define _I2C1PIE_ADRIE_POSN                                 0x3
#define _I2C1PIE_ADRIE_POSITION                             0x3
#define _I2C1PIE_ADRIE_SIZE                                 0x1
#define _I2C1PIE_ADRIE_LENGTH                               0x1
#define _I2C1PIE_ADRIE_MASK                                 0x8
#define _I2C1PIE_WRIE_POSN                                  0x4
#define _I2C1PIE_WRIE_POSITION                              0x4
#define _I2C1PIE_WRIE_SIZE                                  0x1
#define _I2C1PIE_WRIE_LENGTH                                0x1
#define _I2C1PIE_WRIE_MASK                                  0x10
#define _I2C1PIE_ACKTIE_POSN                                0x6
#define _I2C1PIE_ACKTIE_POSITION                            0x6
#define _I2C1PIE_ACKTIE_SIZE                                0x1
#define _I2C1PIE_ACKTIE_LENGTH                              0x1
#define _I2C1PIE_ACKTIE_MASK                                0x40
#define _I2C1PIE_CNTIE_POSN                                 0x7
#define _I2C1PIE_CNTIE_POSITION                             0x7
#define _I2C1PIE_CNTIE_SIZE                                 0x1
#define _I2C1PIE_CNTIE_LENGTH                               0x1
#define _I2C1PIE_CNTIE_MASK                                 0x80
#define _I2C1PIE_SC1IE_POSN                                 0x0
#define _I2C1PIE_SC1IE_POSITION                             0x0
#define _I2C1PIE_SC1IE_SIZE                                 0x1
#define _I2C1PIE_SC1IE_LENGTH                               0x1
#define _I2C1PIE_SC1IE_MASK                                 0x1
#define _I2C1PIE_RSC1IE_POSN                                0x1
#define _I2C1PIE_RSC1IE_POSITION                            0x1
#define _I2C1PIE_RSC1IE_SIZE                                0x1
#define _I2C1PIE_RSC1IE_LENGTH                              0x1
#define _I2C1PIE_RSC1IE_MASK                                0x2
#define _I2C1PIE_PC1IE_POSN                                 0x2
#define _I2C1PIE_PC1IE_POSITION                             0x2
#define _I2C1PIE_PC1IE_SIZE                                 0x1
#define _I2C1PIE_PC1IE_LENGTH                               0x1
#define _I2C1PIE_PC1IE_MASK                                 0x4
#define _I2C1PIE_ADR1IE_POSN                                0x3
#define _I2C1PIE_ADR1IE_POSITION                            0x3
#define _I2C1PIE_ADR1IE_SIZE                                0x1
#define _I2C1PIE_ADR1IE_LENGTH                              0x1
#define _I2C1PIE_ADR1IE_MASK                                0x8
#define _I2C1PIE_WR1IE_POSN                                 0x4
#define _I2C1PIE_WR1IE_POSITION                             0x4
#define _I2C1PIE_WR1IE_SIZE                                 0x1
#define _I2C1PIE_WR1IE_LENGTH                               0x1
#define _I2C1PIE_WR1IE_MASK                                 0x10
#define _I2C1PIE_ACKT1IE_POSN                               0x6
#define _I2C1PIE_ACKT1IE_POSITION                           0x6
#define _I2C1PIE_ACKT1IE_SIZE                               0x1
#define _I2C1PIE_ACKT1IE_LENGTH                             0x1
#define _I2C1PIE_ACKT1IE_MASK                               0x40
#define _I2C1PIE_CNT1IE_POSN                                0x7
#define _I2C1PIE_CNT1IE_POSITION                            0x7
#define _I2C1PIE_CNT1IE_SIZE                                0x1
#define _I2C1PIE_CNT1IE_LENGTH                              0x1
#define _I2C1PIE_CNT1IE_MASK                                0x80

// Register: I2C1ERR
#define I2C1ERR I2C1ERR
extern volatile unsigned char           I2C1ERR             __at(0x1EC);
#ifndef _LIB_BUILD
asm("I2C1ERR equ 01ECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NACKIE                 :1;
        unsigned BCLIE                  :1;
        unsigned BTOIE                  :1;
        unsigned                        :1;
        unsigned NACKIF                 :1;
        unsigned BCLIF                  :1;
        unsigned BTOIF                  :1;
    };
    struct {
        unsigned NACK1IE                :1;
        unsigned BCL1IE                 :1;
        unsigned BTO1IE                 :1;
        unsigned                        :1;
        unsigned NACK1IF                :1;
        unsigned BCL1IF                 :1;
        unsigned BTO1IF                 :1;
    };
} I2C1ERRbits_t;
