garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: I2C1ADB1
#define I2C1ADB1 I2C1ADB1
extern volatile unsigned char           I2C1ADB1            __at(0x1F2);
#ifndef _LIB_BUILD
asm("I2C1ADB1 equ 01F2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADB                    :8;
    };
} I2C1ADB1bits_t;
extern volatile I2C1ADB1bits_t I2C1ADB1bits __at(0x1F2);
// bitfield macros
#define _I2C1ADB1_ADB_POSN                                  0x0
#define _I2C1ADB1_ADB_POSITION                              0x0
#define _I2C1ADB1_ADB_SIZE                                  0x8
#define _I2C1ADB1_ADB_LENGTH                                0x8
#define _I2C1ADB1_ADB_MASK                                  0xFF

// Register: I2C1ADR0
#define I2C1ADR0 I2C1ADR0
extern volatile unsigned char           I2C1ADR0            __at(0x1F3);
#ifndef _LIB_BUILD
asm("I2C1ADR0 equ 01F3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR0bits_t;
extern volatile I2C1ADR0bits_t I2C1ADR0bits __at(0x1F3);
// bitfield macros
#define _I2C1ADR0_ADR_POSN                                  0x0
#define _I2C1ADR0_ADR_POSITION                              0x0
#define _I2C1ADR0_ADR_SIZE                                  0x8
#define _I2C1ADR0_ADR_LENGTH                                0x8
#define _I2C1ADR0_ADR_MASK                                  0xFF

// Register: I2C1ADR1
#define I2C1ADR1 I2C1ADR1
extern volatile unsigned char           I2C1ADR1            __at(0x1F4);
#ifndef _LIB_BUILD
asm("I2C1ADR1 equ 01F4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR1bits_t;
extern volatile I2C1ADR1bits_t I2C1ADR1bits __at(0x1F4);
// bitfield macros
#define _I2C1ADR1_ADR_POSN                                  0x1
#define _I2C1ADR1_ADR_POSITION                              0x1
#define _I2C1ADR1_ADR_SIZE                                  0x7
#define _I2C1ADR1_ADR_LENGTH                                0x7
#define _I2C1ADR1_ADR_MASK                                  0xFE

// Register: I2C1ADR2
#define I2C1ADR2 I2C1ADR2
extern volatile unsigned char           I2C1ADR2            __at(0x1F5);
#ifndef _LIB_BUILD
asm("I2C1ADR2 equ 01F5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
} I2C1ADR2bits_t;
extern volatile I2C1ADR2bits_t I2C1ADR2bits __at(0x1F5);
// bitfield macros
#define _I2C1ADR2_ADR_POSN                                  0x0
#define _I2C1ADR2_ADR_POSITION                              0x0
#define _I2C1ADR2_ADR_SIZE                                  0x8
#define _I2C1ADR2_ADR_LENGTH                                0x8
#define _I2C1ADR2_ADR_MASK                                  0xFF

// Register: I2C1ADR3
#define I2C1ADR3 I2C1ADR3
extern volatile unsigned char           I2C1ADR3            __at(0x1F6);
#ifndef _LIB_BUILD
asm("I2C1ADR3 equ 01F6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ADR                    :7;
    };
} I2C1ADR3bits_t;
extern volatile I2C1ADR3bits_t I2C1ADR3bits __at(0x1F6);
// bitfield macros
#define _I2C1ADR3_ADR_POSN                                  0x1
#define _I2C1ADR3_ADR_POSITION                              0x1
#define _I2C1ADR3_ADR_SIZE                                  0x7
#define _I2C1ADR3_ADR_LENGTH                                0x7
#define _I2C1ADR3_ADR_MASK                                  0xFE

// Register: I2C1BTO
#define I2C1BTO I2C1BTO
extern volatile unsigned char           I2C1BTO             __at(0x1F7);
#ifndef _LIB_BUILD
asm("I2C1BTO equ 01F7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOTIME                 :6;
        unsigned TOBY32                 :1;
        unsigned TOREC                  :1;
    };
    struct {
        unsigned TOTIME0                :1;
        unsigned TOTIME1                :1;
        unsigned TOTIME2                :1;
        unsigned TOTIME3                :1;
        unsigned TOTIME4                :1;
        unsigned TOTIME5                :1;
    };
} I2C1BTObits_t;
extern volatile I2C1BTObits_t I2C1BTObits __at(0x1F7);
// bitfield macros
#define _I2C1BTO_TOTIME_POSN                                0x0
#define _I2C1BTO_TOTIME_POSITION                            0x0
#define _I2C1BTO_TOTIME_SIZE                                0x6
#define _I2C1BTO_TOTIME_LENGTH                              0x6
#define _I2C1BTO_TOTIME_MASK                                0x3F
#define _I2C1BTO_TOBY32_POSN                                0x6
#define _I2C1BTO_TOBY32_POSITION                            0x6
#define _I2C1BTO_TOBY32_SIZE                                0x1
#define _I2C1BTO_TOBY32_LENGTH                              0x1
#define _I2C1BTO_TOBY32_MASK                                0x40
#define _I2C1BTO_TOREC_POSN                                 0x7
#define _I2C1BTO_TOREC_POSITION                             0x7
#define _I2C1BTO_TOREC_SIZE                                 0x1
#define _I2C1BTO_TOREC_LENGTH                               0x1
#define _I2C1BTO_TOREC_MASK                                 0x80
#define _I2C1BTO_TOTIME0_POSN                               0x0
#define _I2C1BTO_TOTIME0_POSITION                           0x0
#define _I2C1BTO_TOTIME0_SIZE                               0x1
#define _I2C1BTO_TOTIME0_LENGTH                             0x1
#define _I2C1BTO_TOTIME0_MASK                               0x1
#define _I2C1BTO_TOTIME1_POSN                               0x1
#define _I2C1BTO_TOTIME1_POSITION                           0x1
#define _I2C1BTO_TOTIME1_SIZE                               0x1
#define _I2C1BTO_TOTIME1_LENGTH                             0x1
#define _I2C1BTO_TOTIME1_MASK                               0x2
#define _I2C1BTO_TOTIME2_POSN                               0x2
#define _I2C1BTO_TOTIME2_POSITION                           0x2
#define _I2C1BTO_TOTIME2_SIZE                               0x1
#define _I2C1BTO_TOTIME2_LENGTH                             0x1
#define _I2C1BTO_TOTIME2_MASK                               0x4
#define _I2C1BTO_TOTIME3_POSN                               0x3
#define _I2C1BTO_TOTIME3_POSITION                           0x3
#define _I2C1BTO_TOTIME3_SIZE                               0x1
#define _I2C1BTO_TOTIME3_LENGTH                             0x1
#define _I2C1BTO_TOTIME3_MASK                               0x8
#define _I2C1BTO_TOTIME4_POSN                               0x4
#define _I2C1BTO_TOTIME4_POSITION                           0x4
#define _I2C1BTO_TOTIME4_SIZE                               0x1
#define _I2C1BTO_TOTIME4_LENGTH                             0x1
#define _I2C1BTO_TOTIME4_MASK                               0x10
#define _I2C1BTO_TOTIME5_POSN                               0x5
#define _I2C1BTO_TOTIME5_POSITION                           0x5
#define _I2C1BTO_TOTIME5_SIZE                               0x1
#define _I2C1BTO_TOTIME5_LENGTH                             0x1
#define _I2C1BTO_TOTIME5_MASK                               0x20

