garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0x351);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INT0PPS
#define INT0PPS INT0PPS
extern volatile unsigned char           INT0PPS             __at(0x352);
#ifndef _LIB_BUILD
asm("INT0PPS equ 0352h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0PPS                :5;
    };
    struct {
        unsigned INT0PPS0               :1;
        unsigned INT0PPS1               :1;
        unsigned INT0PPS2               :1;
        unsigned INT0PPS3               :1;
        unsigned INT0PPS4               :1;
    };
} INT0PPSbits_t;
extern volatile INT0PPSbits_t INT0PPSbits __at(0x352);
// bitfield macros
#define _INT0PPS_INT0PPS_POSN                               0x0
#define _INT0PPS_INT0PPS_POSITION                           0x0
#define _INT0PPS_INT0PPS_SIZE                               0x5
#define _INT0PPS_INT0PPS_LENGTH                             0x5
#define _INT0PPS_INT0PPS_MASK                               0x1F
#define _INT0PPS_INT0PPS0_POSN                              0x0
#define _INT0PPS_INT0PPS0_POSITION                          0x0
#define _INT0PPS_INT0PPS0_SIZE                              0x1
#define _INT0PPS_INT0PPS0_LENGTH                            0x1
#define _INT0PPS_INT0PPS0_MASK                              0x1
#define _INT0PPS_INT0PPS1_POSN                              0x1
#define _INT0PPS_INT0PPS1_POSITION                          0x1
#define _INT0PPS_INT0PPS1_SIZE                              0x1
#define _INT0PPS_INT0PPS1_LENGTH                            0x1
#define _INT0PPS_INT0PPS1_MASK                              0x2
#define _INT0PPS_INT0PPS2_POSN                              0x2
#define _INT0PPS_INT0PPS2_POSITION                          0x2
#define _INT0PPS_INT0PPS2_SIZE                              0x1
#define _INT0PPS_INT0PPS2_LENGTH                            0x1
#define _INT0PPS_INT0PPS2_MASK                              0x4
#define _INT0PPS_INT0PPS3_POSN                              0x3
#define _INT0PPS_INT0PPS3_POSITION                          0x3
#define _INT0PPS_INT0PPS3_SIZE                              0x1
#define _INT0PPS_INT0PPS3_LENGTH                            0x1
#define _INT0PPS_INT0PPS3_MASK                              0x8
#define _INT0PPS_INT0PPS4_POSN                              0x4
#define _INT0PPS_INT0PPS4_POSITION                          0x4
#define _INT0PPS_INT0PPS4_SIZE                              0x1
#define _INT0PPS_INT0PPS4_LENGTH                            0x1
#define _INT0PPS_INT0PPS4_MASK                              0x10

// Register: INT1PPS
#define INT1PPS INT1PPS
extern volatile unsigned char           INT1PPS             __at(0x353);
#ifndef _LIB_BUILD
asm("INT1PPS equ 0353h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1PPS                :5;
    };
    struct {
        unsigned INT1PPS0               :1;
        unsigned INT1PPS1               :1;
        unsigned INT1PPS2               :1;
        unsigned INT1PPS3               :1;
        unsigned INT1PPS4               :1;
    };
} INT1PPSbits_t;
extern volatile INT1PPSbits_t INT1PPSbits __at(0x353);
// bitfield macros
#define _INT1PPS_INT1PPS_POSN                               0x0
#define _INT1PPS_INT1PPS_POSITION                           0x0
#define _INT1PPS_INT1PPS_SIZE                               0x5
#define _INT1PPS_INT1PPS_LENGTH                             0x5
#define _INT1PPS_INT1PPS_MASK                               0x1F
#define _INT1PPS_INT1PPS0_POSN                              0x0
#define _INT1PPS_INT1PPS0_POSITION                          0x0
#define _INT1PPS_INT1PPS0_SIZE                              0x1
#define _INT1PPS_INT1PPS0_LENGTH                            0x1
#define _INT1PPS_INT1PPS0_MASK                              0x1
#define _INT1PPS_INT1PPS1_POSN                              0x1
#define _INT1PPS_INT1PPS1_POSITION                          0x1
#define _INT1PPS_INT1PPS1_SIZE                              0x1
#define _INT1PPS_INT1PPS1_LENGTH                            0x1
#define _INT1PPS_INT1PPS1_MASK                              0x2
#define _INT1PPS_INT1PPS2_POSN                              0x2
#define _INT1PPS_INT1PPS2_POSITION                          0x2
#define _INT1PPS_INT1PPS2_SIZE                              0x1
#define _INT1PPS_INT1PPS2_LENGTH                            0x1
#define _INT1PPS_INT1PPS2_MASK                              0x4
#define _INT1PPS_INT1PPS3_POSN                              0x3
#define _INT1PPS_INT1PPS3_POSITION                          0x3
#define _INT1PPS_INT1PPS3_SIZE                              0x1
#define _INT1PPS_INT1PPS3_LENGTH                            0x1
#define _INT1PPS_INT1PPS3_MASK                              0x8
#define _INT1PPS_INT1PPS4_POSN                              0x4
#define _INT1PPS_INT1PPS4_POSITION                          0x4
#define _INT1PPS_INT1PPS4_SIZE                              0x1
#define _INT1PPS_INT1PPS4_LENGTH                            0x1
#define _INT1PPS_INT1PPS4_MASK                              0x10

// Register: INT2PPS
#define INT2PPS INT2PPS
extern volatile unsigned char           INT2PPS             __at(0x354);
#ifndef _LIB_BUILD
asm("INT2PPS equ 0354h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2PPS                :5;
    };
    struct {
        unsigned INT2PPS0               :1;
        unsigned INT2PPS1               :1;
        unsigned INT2PPS2               :1;
        unsigned INT2PPS3               :1;
        unsigned INT2PPS4               :1;
    };
} INT2PPSbits_t;
extern volatile INT2PPSbits_t INT2PPSbits __at(0x354);
// bitfield macros
#define _INT2PPS_INT2PPS_POSN                               0x0
#define _INT2PPS_INT2PPS_POSITION                           0x0
#define _INT2PPS_INT2PPS_SIZE                               0x5
#define _INT2PPS_INT2PPS_LENGTH                             0x5
#define _INT2PPS_INT2PPS_MASK                               0x1F
#define _INT2PPS_INT2PPS0_POSN                              0x0
#define _INT2PPS_INT2PPS0_POSITION                          0x0
#define _INT2PPS_INT2PPS0_SIZE                              0x1
#define _INT2PPS_INT2PPS0_LENGTH                            0x1
#define _INT2PPS_INT2PPS0_MASK                              0x1
#define _INT2PPS_INT2PPS1_POSN                              0x1
#define _INT2PPS_INT2PPS1_POSITION                          0x1
#define _INT2PPS_INT2PPS1_SIZE                              0x1
#define _INT2PPS_INT2PPS1_LENGTH                            0x1
#define _INT2PPS_INT2PPS1_MASK                              0x2
#define _INT2PPS_INT2PPS2_POSN                              0x2
#define _INT2PPS_INT2PPS2_POSITION                          0x2
#define _INT2PPS_INT2PPS2_SIZE                              0x1
#define _INT2PPS_INT2PPS2_LENGTH                            0x1
#define _INT2PPS_INT2PPS2_MASK                              0x4
#define _INT2PPS_INT2PPS3_POSN                              0x3
#define _INT2PPS_INT2PPS3_POSITION                          0x3
#define _INT2PPS_INT2PPS3_SIZE                              0x1
#define _INT2PPS_INT2PPS3_LENGTH                            0x1
#define _INT2PPS_INT2PPS3_MASK                              0x8
#define _INT2PPS_INT2PPS4_POSN                              0x4
#define _INT2PPS_INT2PPS4_POSITION                          0x4
#define _INT2PPS_INT2PPS4_SIZE                              0x1
#define _INT2PPS_INT2PPS4_LENGTH                            0x1
#define _INT2PPS_INT2PPS4_MASK                              0x10

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0x355);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0355h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0CKIPPS               :5;
    };
    struct {
        unsigned T0CKIPPS0              :1;
        unsigned T0CKIPPS1              :1;
        unsigned T0CKIPPS2              :1;
        unsigned T0CKIPPS3              :1;
        unsigned T0CKIPPS4              :1;
    };
} T0CKIPPSbits_t;
extern volatile T0CKIPPSbits_t T0CKIPPSbits __at(0x355);
// bitfield macros
#define _T0CKIPPS_T0CKIPPS_POSN                             0x0
#define _T0CKIPPS_T0CKIPPS_POSITION                         0x0
#define _T0CKIPPS_T0CKIPPS_SIZE                             0x5
#define _T0CKIPPS_T0CKIPPS_LENGTH                           0x5
#define _T0CKIPPS_T0CKIPPS_MASK                             0x1F
#define _T0CKIPPS_T0CKIPPS0_POSN                            0x0
#define _T0CKIPPS_T0CKIPPS0_POSITION                        0x0
#define _T0CKIPPS_T0CKIPPS0_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS0_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS0_MASK                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSN                            0x1
#define _T0CKIPPS_T0CKIPPS1_POSITION                        0x1
#define _T0CKIPPS_T0CKIPPS1_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS1_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS1_MASK                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSN                            0x2
#define _T0CKIPPS_T0CKIPPS2_POSITION                        0x2
#define _T0CKIPPS_T0CKIPPS2_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS2_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS2_MASK                            0x4
#define _T0CKIPPS_T0CKIPPS3_POSN                            0x3
#define _T0CKIPPS_T0CKIPPS3_POSITION                        0x3
#define _T0CKIPPS_T0CKIPPS3_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS3_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS3_MASK                            0x8
#define _T0CKIPPS_T0CKIPPS4_POSN                            0x4
#define _T0CKIPPS_T0CKIPPS4_POSITION                        0x4
#define _T0CKIPPS_T0CKIPPS4_SIZE                            0x1
#define _T0CKIPPS_T0CKIPPS4_LENGTH                          0x1
#define _T0CKIPPS_T0CKIPPS4_MASK                            0x10

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
extern volatile unsigned char           T1CKIPPS            __at(0x356);
#ifndef _LIB_BUILD
asm("T1CKIPPS equ 0356h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T1CKIPPS               :5;
    };
    struct {
        unsigned T1CKIPPS0              :1;
        unsigned T1CKIPPS1              :1;
        unsigned T1CKIPPS2              :1;
        unsigned T1CKIPPS3              :1;
        unsigned T1CKIPPS4              :1;
    };
} T1CKIPPSbits_t;
