garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: U2RXPPS
#define U2RXPPS U2RXPPS
extern volatile unsigned char           U2RXPPS             __at(0x3A4);
#ifndef _LIB_BUILD
asm("U2RXPPS equ 03A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXPPS                :5;
    };
    struct {
        unsigned U2RXPPS0               :1;
        unsigned U2RXPPS1               :1;
        unsigned U2RXPPS2               :1;
        unsigned U2RXPPS3               :1;
        unsigned U2RXPPS4               :1;
    };
} U2RXPPSbits_t;
extern volatile U2RXPPSbits_t U2RXPPSbits __at(0x3A4);
// bitfield macros
#define _U2RXPPS_U2RXPPS_POSN                               0x0
#define _U2RXPPS_U2RXPPS_POSITION                           0x0
#define _U2RXPPS_U2RXPPS_SIZE                               0x5
#define _U2RXPPS_U2RXPPS_LENGTH                             0x5
#define _U2RXPPS_U2RXPPS_MASK                               0x1F
#define _U2RXPPS_U2RXPPS0_POSN                              0x0
#define _U2RXPPS_U2RXPPS0_POSITION                          0x0
#define _U2RXPPS_U2RXPPS0_SIZE                              0x1
#define _U2RXPPS_U2RXPPS0_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS0_MASK                              0x1
#define _U2RXPPS_U2RXPPS1_POSN                              0x1
#define _U2RXPPS_U2RXPPS1_POSITION                          0x1
#define _U2RXPPS_U2RXPPS1_SIZE                              0x1
#define _U2RXPPS_U2RXPPS1_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS1_MASK                              0x2
#define _U2RXPPS_U2RXPPS2_POSN                              0x2
#define _U2RXPPS_U2RXPPS2_POSITION                          0x2
#define _U2RXPPS_U2RXPPS2_SIZE                              0x1
#define _U2RXPPS_U2RXPPS2_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS2_MASK                              0x4
#define _U2RXPPS_U2RXPPS3_POSN                              0x3
#define _U2RXPPS_U2RXPPS3_POSITION                          0x3
#define _U2RXPPS_U2RXPPS3_SIZE                              0x1
#define _U2RXPPS_U2RXPPS3_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS3_MASK                              0x8
#define _U2RXPPS_U2RXPPS4_POSN                              0x4
#define _U2RXPPS_U2RXPPS4_POSITION                          0x4
#define _U2RXPPS_U2RXPPS4_SIZE                              0x1
#define _U2RXPPS_U2RXPPS4_LENGTH                            0x1
#define _U2RXPPS_U2RXPPS4_MASK                              0x10

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
extern volatile unsigned char           SPI1SCKPPS          __at(0x3A7);
#ifndef _LIB_BUILD
asm("SPI1SCKPPS equ 03A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SCKPPS             :5;
    };
    struct {
        unsigned SPI1SCKPPS0            :1;
        unsigned SPI1SCKPPS1            :1;
        unsigned SPI1SCKPPS2            :1;
        unsigned SPI1SCKPPS3            :1;
        unsigned SPI1SCKPPS4            :1;
    };
} SPI1SCKPPSbits_t;
extern volatile SPI1SCKPPSbits_t SPI1SCKPPSbits __at(0x3A7);
// bitfield macros
#define _SPI1SCKPPS_SPI1SCKPPS_POSN                         0x0
#define _SPI1SCKPPS_SPI1SCKPPS_POSITION                     0x0
#define _SPI1SCKPPS_SPI1SCKPPS_SIZE                         0x5
#define _SPI1SCKPPS_SPI1SCKPPS_LENGTH                       0x5
#define _SPI1SCKPPS_SPI1SCKPPS_MASK                         0x1F
#define _SPI1SCKPPS_SPI1SCKPPS0_POSN                        0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_POSITION                    0x0
#define _SPI1SCKPPS_SPI1SCKPPS0_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS0_MASK                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSN                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_POSITION                    0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS1_MASK                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSN                        0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_POSITION                    0x2
#define _SPI1SCKPPS_SPI1SCKPPS2_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS2_MASK                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS3_POSN                        0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_POSITION                    0x3
#define _SPI1SCKPPS_SPI1SCKPPS3_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS3_MASK                        0x8
#define _SPI1SCKPPS_SPI1SCKPPS4_POSN                        0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_POSITION                    0x4
#define _SPI1SCKPPS_SPI1SCKPPS4_SIZE                        0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_LENGTH                      0x1
#define _SPI1SCKPPS_SPI1SCKPPS4_MASK                        0x10

// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
extern volatile unsigned char           SPI1SDIPPS          __at(0x3A8);
#ifndef _LIB_BUILD
asm("SPI1SDIPPS equ 03A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SDIPPS             :5;
    };
    struct {
        unsigned SPI1SDIPPS0            :1;
        unsigned SPI1SDIPPS1            :1;
        unsigned SPI1SDIPPS2            :1;
        unsigned SPI1SDIPPS3            :1;
        unsigned SPI1SDIPPS4            :1;
    };
} SPI1SDIPPSbits_t;
extern volatile SPI1SDIPPSbits_t SPI1SDIPPSbits __at(0x3A8);
// bitfield macros
#define _SPI1SDIPPS_SPI1SDIPPS_POSN                         0x0
#define _SPI1SDIPPS_SPI1SDIPPS_POSITION                     0x0
#define _SPI1SDIPPS_SPI1SDIPPS_SIZE                         0x5
#define _SPI1SDIPPS_SPI1SDIPPS_LENGTH                       0x5
#define _SPI1SDIPPS_SPI1SDIPPS_MASK                         0x1F
#define _SPI1SDIPPS_SPI1SDIPPS0_POSN                        0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_POSITION                    0x0
#define _SPI1SDIPPS_SPI1SDIPPS0_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS0_MASK                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSN                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_POSITION                    0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS1_MASK                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSN                        0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_POSITION                    0x2
#define _SPI1SDIPPS_SPI1SDIPPS2_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS2_MASK                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS3_POSN                        0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_POSITION                    0x3
#define _SPI1SDIPPS_SPI1SDIPPS3_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS3_MASK                        0x8
#define _SPI1SDIPPS_SPI1SDIPPS4_POSN                        0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_POSITION                    0x4
#define _SPI1SDIPPS_SPI1SDIPPS4_SIZE                        0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_LENGTH                      0x1
#define _SPI1SDIPPS_SPI1SDIPPS4_MASK                        0x10

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
extern volatile unsigned char           SPI1SSPPS           __at(0x3A9);
#ifndef _LIB_BUILD
asm("SPI1SSPPS equ 03A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1SSPPS              :5;
    };
    struct {
        unsigned SPI1SSPPS0             :1;
        unsigned SPI1SSPPS1             :1;
        unsigned SPI1SSPPS2             :1;
        unsigned SPI1SSPPS3             :1;
        unsigned SPI1SSPPS4             :1;
    };
} SPI1SSPPSbits_t;
extern volatile SPI1SSPPSbits_t SPI1SSPPSbits __at(0x3A9);
// bitfield macros
#define _SPI1SSPPS_SPI1SSPPS_POSN                           0x0
#define _SPI1SSPPS_SPI1SSPPS_POSITION                       0x0
#define _SPI1SSPPS_SPI1SSPPS_SIZE                           0x5
#define _SPI1SSPPS_SPI1SSPPS_LENGTH                         0x5
#define _SPI1SSPPS_SPI1SSPPS_MASK                           0x1F
#define _SPI1SSPPS_SPI1SSPPS0_POSN                          0x0
#define _SPI1SSPPS_SPI1SSPPS0_POSITION                      0x0
#define _SPI1SSPPS_SPI1SSPPS0_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS0_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS0_MASK                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSN                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_POSITION                      0x1
#define _SPI1SSPPS_SPI1SSPPS1_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS1_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS1_MASK                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSN                          0x2
#define _SPI1SSPPS_SPI1SSPPS2_POSITION                      0x2
#define _SPI1SSPPS_SPI1SSPPS2_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS2_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS2_MASK                          0x4
#define _SPI1SSPPS_SPI1SSPPS3_POSN                          0x3
#define _SPI1SSPPS_SPI1SSPPS3_POSITION                      0x3
#define _SPI1SSPPS_SPI1SSPPS3_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS3_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS3_MASK                          0x8
#define _SPI1SSPPS_SPI1SSPPS4_POSN                          0x4
#define _SPI1SSPPS_SPI1SSPPS4_POSITION                      0x4
#define _SPI1SSPPS_SPI1SSPPS4_SIZE                          0x1
#define _SPI1SSPPS_SPI1SSPPS4_LENGTH                        0x1
#define _SPI1SSPPS_SPI1SSPPS4_MASK                          0x10

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
extern volatile unsigned char           I2C1SCLPPS          __at(0x3AD);
#ifndef _LIB_BUILD
asm("I2C1SCLPPS equ 03ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1SCLPPS             :5;
    };
    struct {
        unsigned I2C1SCLPPS0            :1;
        unsigned I2C1SCLPPS1            :1;
        unsigned I2C1SCLPPS2            :1;
        unsigned I2C1SCLPPS3            :1;
        unsigned I2C1SCLPPS4            :1;
    };
} I2C1SCLPPSbits_t;
extern volatile I2C1SCLPPSbits_t I2C1SCLPPSbits __at(0x3AD);
// bitfield macros
#define _I2C1SCLPPS_I2C1SCLPPS_POSN                         0x0
#define _I2C1SCLPPS_I2C1SCLPPS_POSITION                     0x0
#define _I2C1SCLPPS_I2C1SCLPPS_SIZE                         0x5
#define _I2C1SCLPPS_I2C1SCLPPS_LENGTH                       0x5
#define _I2C1SCLPPS_I2C1SCLPPS_MASK                         0x1F
#define _I2C1SCLPPS_I2C1SCLPPS0_POSN                        0x0
#define _I2C1SCLPPS_I2C1SCLPPS0_POSITION                    0x0
#define _I2C1SCLPPS_I2C1SCLPPS0_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS0_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS0_MASK                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_POSN                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_POSITION                    0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS1_MASK                        0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_POSN                        0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_POSITION                    0x2
#define _I2C1SCLPPS_I2C1SCLPPS2_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS2_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS2_MASK                        0x4
#define _I2C1SCLPPS_I2C1SCLPPS3_POSN                        0x3
#define _I2C1SCLPPS_I2C1SCLPPS3_POSITION                    0x3
#define _I2C1SCLPPS_I2C1SCLPPS3_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS3_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS3_MASK                        0x8
#define _I2C1SCLPPS_I2C1SCLPPS4_POSN                        0x4
#define _I2C1SCLPPS_I2C1SCLPPS4_POSITION                    0x4
#define _I2C1SCLPPS_I2C1SCLPPS4_SIZE                        0x1
#define _I2C1SCLPPS_I2C1SCLPPS4_LENGTH                      0x1
#define _I2C1SCLPPS_I2C1SCLPPS4_MASK                        0x10

