garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
extern volatile PIR0bits_t PIR0bits __at(0x469);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_INT0IF_POSN                                   0x1
#define _PIR0_INT0IF_POSITION                               0x1
#define _PIR0_INT0IF_SIZE                                   0x1
#define _PIR0_INT0IF_LENGTH                                 0x1
#define _PIR0_INT0IF_MASK                                   0x2
#define _PIR0_INT1IF_POSN                                   0x2
#define _PIR0_INT1IF_POSITION                               0x2
#define _PIR0_INT1IF_SIZE                                   0x1
#define _PIR0_INT1IF_LENGTH                                 0x1
#define _PIR0_INT1IF_MASK                                   0x4
#define _PIR0_INT2IF_POSN                                   0x3
#define _PIR0_INT2IF_POSITION                               0x3
#define _PIR0_INT2IF_SIZE                                   0x1
#define _PIR0_INT2IF_LENGTH                                 0x1
#define _PIR0_INT2IF_MASK                                   0x8
#define _PIR0_DMA1SCNTIF_POSN                               0x4
#define _PIR0_DMA1SCNTIF_POSITION                           0x4
#define _PIR0_DMA1SCNTIF_SIZE                               0x1
#define _PIR0_DMA1SCNTIF_LENGTH                             0x1
#define _PIR0_DMA1SCNTIF_MASK                               0x10
#define _PIR0_DMA1DCNTIF_POSN                               0x5
#define _PIR0_DMA1DCNTIF_POSITION                           0x5
#define _PIR0_DMA1DCNTIF_SIZE                               0x1
#define _PIR0_DMA1DCNTIF_LENGTH                             0x1
#define _PIR0_DMA1DCNTIF_MASK                               0x20
#define _PIR0_DMA1ORIF_POSN                                 0x6
#define _PIR0_DMA1ORIF_POSITION                             0x6
#define _PIR0_DMA1ORIF_SIZE                                 0x1
#define _PIR0_DMA1ORIF_LENGTH                               0x1
#define _PIR0_DMA1ORIF_MASK                                 0x40
#define _PIR0_DMA1AIF_POSN                                  0x7
#define _PIR0_DMA1AIF_POSITION                              0x7
#define _PIR0_DMA1AIF_SIZE                                  0x1
#define _PIR0_DMA1AIF_LENGTH                                0x1
#define _PIR0_DMA1AIF_MASK                                  0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x46A);
#ifndef _LIB_BUILD
asm("PIR1 equ 046Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA2SCNTIF             :1;
        unsigned DMA2DCNTIF             :1;
        unsigned DMA2ORIF               :1;
        unsigned DMA2AIF                :1;
        unsigned DMA3SCNTIF             :1;
        unsigned DMA3DCNTIF             :1;
        unsigned DMA3ORIF               :1;
        unsigned DMA3AIF                :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x46A);
// bitfield macros
#define _PIR1_DMA2SCNTIF_POSN                               0x0
#define _PIR1_DMA2SCNTIF_POSITION                           0x0
#define _PIR1_DMA2SCNTIF_SIZE                               0x1
#define _PIR1_DMA2SCNTIF_LENGTH                             0x1
#define _PIR1_DMA2SCNTIF_MASK                               0x1
#define _PIR1_DMA2DCNTIF_POSN                               0x1
#define _PIR1_DMA2DCNTIF_POSITION                           0x1
#define _PIR1_DMA2DCNTIF_SIZE                               0x1
#define _PIR1_DMA2DCNTIF_LENGTH                             0x1
#define _PIR1_DMA2DCNTIF_MASK                               0x2
#define _PIR1_DMA2ORIF_POSN                                 0x2
#define _PIR1_DMA2ORIF_POSITION                             0x2
#define _PIR1_DMA2ORIF_SIZE                                 0x1
#define _PIR1_DMA2ORIF_LENGTH                               0x1
#define _PIR1_DMA2ORIF_MASK                                 0x4
#define _PIR1_DMA2AIF_POSN                                  0x3
#define _PIR1_DMA2AIF_POSITION                              0x3
#define _PIR1_DMA2AIF_SIZE                                  0x1
#define _PIR1_DMA2AIF_LENGTH                                0x1
#define _PIR1_DMA2AIF_MASK                                  0x8
#define _PIR1_DMA3SCNTIF_POSN                               0x4
#define _PIR1_DMA3SCNTIF_POSITION                           0x4
#define _PIR1_DMA3SCNTIF_SIZE                               0x1
#define _PIR1_DMA3SCNTIF_LENGTH                             0x1
#define _PIR1_DMA3SCNTIF_MASK                               0x10
#define _PIR1_DMA3DCNTIF_POSN                               0x5
#define _PIR1_DMA3DCNTIF_POSITION                           0x5
#define _PIR1_DMA3DCNTIF_SIZE                               0x1
#define _PIR1_DMA3DCNTIF_LENGTH                             0x1
#define _PIR1_DMA3DCNTIF_MASK                               0x20
#define _PIR1_DMA3ORIF_POSN                                 0x6
#define _PIR1_DMA3ORIF_POSITION                             0x6
#define _PIR1_DMA3ORIF_SIZE                                 0x1
#define _PIR1_DMA3ORIF_LENGTH                               0x1
#define _PIR1_DMA3ORIF_MASK                                 0x40
#define _PIR1_DMA3AIF_POSN                                  0x7
#define _PIR1_DMA3AIF_POSITION                              0x7
#define _PIR1_DMA3AIF_SIZE                                  0x1
#define _PIR1_DMA3AIF_LENGTH                                0x1
#define _PIR1_DMA3AIF_MASK                                  0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x46B);
#ifndef _LIB_BUILD
asm("PIR2 equ 046Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA4SCNTIF             :1;
        unsigned DMA4DCNTIF             :1;
        unsigned DMA4ORIF               :1;
        unsigned DMA4AIF                :1;
        unsigned NVMIF                  :1;
        unsigned CRCIF                  :1;
        unsigned SCANIF                 :1;
        unsigned ACTIF                  :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x46B);
// bitfield macros
#define _PIR2_DMA4SCNTIF_POSN                               0x0
#define _PIR2_DMA4SCNTIF_POSITION                           0x0
#define _PIR2_DMA4SCNTIF_SIZE                               0x1
#define _PIR2_DMA4SCNTIF_LENGTH                             0x1
#define _PIR2_DMA4SCNTIF_MASK                               0x1
#define _PIR2_DMA4DCNTIF_POSN                               0x1
#define _PIR2_DMA4DCNTIF_POSITION                           0x1
#define _PIR2_DMA4DCNTIF_SIZE                               0x1
#define _PIR2_DMA4DCNTIF_LENGTH                             0x1
#define _PIR2_DMA4DCNTIF_MASK                               0x2
#define _PIR2_DMA4ORIF_POSN                                 0x2
#define _PIR2_DMA4ORIF_POSITION                             0x2
#define _PIR2_DMA4ORIF_SIZE                                 0x1
#define _PIR2_DMA4ORIF_LENGTH                               0x1
#define _PIR2_DMA4ORIF_MASK                                 0x4
#define _PIR2_DMA4AIF_POSN                                  0x3
#define _PIR2_DMA4AIF_POSITION                              0x3
#define _PIR2_DMA4AIF_SIZE                                  0x1
#define _PIR2_DMA4AIF_LENGTH                                0x1
#define _PIR2_DMA4AIF_MASK                                  0x8
#define _PIR2_NVMIF_POSN                                    0x4
#define _PIR2_NVMIF_POSITION                                0x4
#define _PIR2_NVMIF_SIZE                                    0x1
#define _PIR2_NVMIF_LENGTH                                  0x1
#define _PIR2_NVMIF_MASK                                    0x10
#define _PIR2_CRCIF_POSN                                    0x5
#define _PIR2_CRCIF_POSITION                                0x5
#define _PIR2_CRCIF_SIZE                                    0x1
#define _PIR2_CRCIF_LENGTH                                  0x1
#define _PIR2_CRCIF_MASK                                    0x20
#define _PIR2_SCANIF_POSN                                   0x6
#define _PIR2_SCANIF_POSITION                               0x6
#define _PIR2_SCANIF_SIZE                                   0x1
#define _PIR2_SCANIF_LENGTH                                 0x1
#define _PIR2_SCANIF_MASK                                   0x40
#define _PIR2_ACTIF_POSN                                    0x7
#define _PIR2_ACTIF_POSITION                                0x7
#define _PIR2_ACTIF_SIZE                                    0x1
#define _PIR2_ACTIF_LENGTH                                  0x1
#define _PIR2_ACTIF_MASK                                    0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x46C);
#ifndef _LIB_BUILD
asm("PIR3 equ 046Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSWIF                  :1;
        unsigned OSFIF                  :1;
        unsigned VDDIO2IF               :1;
        unsigned                        :1;
        unsigned IOCIF                  :1;
        unsigned TMR0IF                 :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
    };
} PIR3bits_t;
