garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
extern volatile PIR3bits_t PIR3bits __at(0x46C);
// bitfield macros
#define _PIR3_CSWIF_POSN                                    0x0
#define _PIR3_CSWIF_POSITION                                0x0
#define _PIR3_CSWIF_SIZE                                    0x1
#define _PIR3_CSWIF_LENGTH                                  0x1
#define _PIR3_CSWIF_MASK                                    0x1
#define _PIR3_OSFIF_POSN                                    0x1
#define _PIR3_OSFIF_POSITION                                0x1
#define _PIR3_OSFIF_SIZE                                    0x1
#define _PIR3_OSFIF_LENGTH                                  0x1
#define _PIR3_OSFIF_MASK                                    0x2
#define _PIR3_VDDIO2IF_POSN                                 0x2
#define _PIR3_VDDIO2IF_POSITION                             0x2
#define _PIR3_VDDIO2IF_SIZE                                 0x1
#define _PIR3_VDDIO2IF_LENGTH                               0x1
#define _PIR3_VDDIO2IF_MASK                                 0x4
#define _PIR3_IOCIF_POSN                                    0x4
#define _PIR3_IOCIF_POSITION                                0x4
#define _PIR3_IOCIF_SIZE                                    0x1
#define _PIR3_IOCIF_LENGTH                                  0x1
#define _PIR3_IOCIF_MASK                                    0x10
#define _PIR3_TMR0IF_POSN                                   0x5
#define _PIR3_TMR0IF_POSITION                               0x5
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x20
#define _PIR3_TMR1IF_POSN                                   0x6
#define _PIR3_TMR1IF_POSITION                               0x6
#define _PIR3_TMR1IF_SIZE                                   0x1
#define _PIR3_TMR1IF_LENGTH                                 0x1
#define _PIR3_TMR1IF_MASK                                   0x40
#define _PIR3_TMR1GIF_POSN                                  0x7
#define _PIR3_TMR1GIF_POSITION                              0x7
#define _PIR3_TMR1GIF_SIZE                                  0x1
#define _PIR3_TMR1GIF_LENGTH                                0x1
#define _PIR3_TMR1GIF_MASK                                  0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x46D);
#ifndef _LIB_BUILD
asm("PIR4 equ 046Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR2IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned TU16AIF                :1;
        unsigned TU16BIF                :1;
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x46D);
// bitfield macros
#define _PIR4_TMR2IF_POSN                                   0x0
#define _PIR4_TMR2IF_POSITION                               0x0
#define _PIR4_TMR2IF_SIZE                                   0x1
#define _PIR4_TMR2IF_LENGTH                                 0x1
#define _PIR4_TMR2IF_MASK                                   0x1
#define _PIR4_TMR4IF_POSN                                   0x1
#define _PIR4_TMR4IF_POSITION                               0x1
#define _PIR4_TMR4IF_SIZE                                   0x1
#define _PIR4_TMR4IF_LENGTH                                 0x1
#define _PIR4_TMR4IF_MASK                                   0x2
#define _PIR4_TU16AIF_POSN                                  0x2
#define _PIR4_TU16AIF_POSITION                              0x2
#define _PIR4_TU16AIF_SIZE                                  0x1
#define _PIR4_TU16AIF_LENGTH                                0x1
#define _PIR4_TU16AIF_MASK                                  0x4
#define _PIR4_TU16BIF_POSN                                  0x3
#define _PIR4_TU16BIF_POSITION                              0x3
#define _PIR4_TU16BIF_SIZE                                  0x1
#define _PIR4_TU16BIF_LENGTH                                0x1
#define _PIR4_TU16BIF_MASK                                  0x8
#define _PIR4_CCP1IF_POSN                                   0x4
#define _PIR4_CCP1IF_POSITION                               0x4
#define _PIR4_CCP1IF_SIZE                                   0x1
#define _PIR4_CCP1IF_LENGTH                                 0x1
#define _PIR4_CCP1IF_MASK                                   0x10
#define _PIR4_CCP2IF_POSN                                   0x5
#define _PIR4_CCP2IF_POSITION                               0x5
#define _PIR4_CCP2IF_SIZE                                   0x1
#define _PIR4_CCP2IF_LENGTH                                 0x1
#define _PIR4_CCP2IF_MASK                                   0x20
#define _PIR4_PWM1PIF_POSN                                  0x6
#define _PIR4_PWM1PIF_POSITION                              0x6
#define _PIR4_PWM1PIF_SIZE                                  0x1
#define _PIR4_PWM1PIF_LENGTH                                0x1
#define _PIR4_PWM1PIF_MASK                                  0x40
#define _PIR4_PWM1IF_POSN                                   0x7
#define _PIR4_PWM1IF_POSITION                               0x7
#define _PIR4_PWM1IF_SIZE                                   0x1
#define _PIR4_PWM1IF_LENGTH                                 0x1
#define _PIR4_PWM1IF_MASK                                   0x80

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x46E);
#ifndef _LIB_BUILD
asm("PIR5 equ 046Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2PIF                :1;
        unsigned PWM2IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
        unsigned IOCSRIF                :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x46E);
// bitfield macros
#define _PIR5_PWM2PIF_POSN                                  0x0
#define _PIR5_PWM2PIF_POSITION                              0x0
#define _PIR5_PWM2PIF_SIZE                                  0x1
#define _PIR5_PWM2PIF_LENGTH                                0x1
#define _PIR5_PWM2PIF_MASK                                  0x1
#define _PIR5_PWM2IF_POSN                                   0x1
#define _PIR5_PWM2IF_POSITION                               0x1
#define _PIR5_PWM2IF_SIZE                                   0x1
#define _PIR5_PWM2IF_LENGTH                                 0x1
#define _PIR5_PWM2IF_MASK                                   0x2
#define _PIR5_CWG1IF_POSN                                   0x2
#define _PIR5_CWG1IF_POSITION                               0x2
#define _PIR5_CWG1IF_SIZE                                   0x1
#define _PIR5_CWG1IF_LENGTH                                 0x1
#define _PIR5_CWG1IF_MASK                                   0x4
#define _PIR5_CLC1IF_POSN                                   0x3
#define _PIR5_CLC1IF_POSITION                               0x3
#define _PIR5_CLC1IF_SIZE                                   0x1
#define _PIR5_CLC1IF_LENGTH                                 0x1
#define _PIR5_CLC1IF_MASK                                   0x8
#define _PIR5_CLC2IF_POSN                                   0x4
#define _PIR5_CLC2IF_POSITION                               0x4
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x10
#define _PIR5_CLC3IF_POSN                                   0x5
#define _PIR5_CLC3IF_POSITION                               0x5
#define _PIR5_CLC3IF_SIZE                                   0x1
#define _PIR5_CLC3IF_LENGTH                                 0x1
#define _PIR5_CLC3IF_MASK                                   0x20
#define _PIR5_CLC4IF_POSN                                   0x6
#define _PIR5_CLC4IF_POSITION                               0x6
#define _PIR5_CLC4IF_SIZE                                   0x1
#define _PIR5_CLC4IF_LENGTH                                 0x1
#define _PIR5_CLC4IF_MASK                                   0x40
#define _PIR5_IOCSRIF_POSN                                  0x7
#define _PIR5_IOCSRIF_POSITION                              0x7
#define _PIR5_IOCSRIF_SIZE                                  0x1
#define _PIR5_IOCSRIF_LENGTH                                0x1
#define _PIR5_IOCSRIF_MASK                                  0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x46F);
#ifndef _LIB_BUILD
asm("PIR6 equ 046Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1IF                   :1;
        unsigned U1EIF                  :1;
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2IF                   :1;
        unsigned U2EIF                  :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x46F);
// bitfield macros
#define _PIR6_U1RXIF_POSN                                   0x0
#define _PIR6_U1RXIF_POSITION                               0x0
#define _PIR6_U1RXIF_SIZE                                   0x1
#define _PIR6_U1RXIF_LENGTH                                 0x1
#define _PIR6_U1RXIF_MASK                                   0x1
#define _PIR6_U1TXIF_POSN                                   0x1
#define _PIR6_U1TXIF_POSITION                               0x1
#define _PIR6_U1TXIF_SIZE                                   0x1
#define _PIR6_U1TXIF_LENGTH                                 0x1
#define _PIR6_U1TXIF_MASK                                   0x2
#define _PIR6_U1IF_POSN                                     0x2
#define _PIR6_U1IF_POSITION                                 0x2
#define _PIR6_U1IF_SIZE                                     0x1
#define _PIR6_U1IF_LENGTH                                   0x1
#define _PIR6_U1IF_MASK                                     0x4
#define _PIR6_U1EIF_POSN                                    0x3
#define _PIR6_U1EIF_POSITION                                0x3
#define _PIR6_U1EIF_SIZE                                    0x1
#define _PIR6_U1EIF_LENGTH                                  0x1
#define _PIR6_U1EIF_MASK                                    0x8
#define _PIR6_U2RXIF_POSN                                   0x4
#define _PIR6_U2RXIF_POSITION                               0x4
#define _PIR6_U2RXIF_SIZE                                   0x1
#define _PIR6_U2RXIF_LENGTH                                 0x1
#define _PIR6_U2RXIF_MASK                                   0x10
#define _PIR6_U2TXIF_POSN                                   0x5
#define _PIR6_U2TXIF_POSITION                               0x5
#define _PIR6_U2TXIF_SIZE                                   0x1
#define _PIR6_U2TXIF_LENGTH                                 0x1
#define _PIR6_U2TXIF_MASK                                   0x20
#define _PIR6_U2IF_POSN                                     0x6
#define _PIR6_U2IF_POSITION                                 0x6
#define _PIR6_U2IF_SIZE                                     0x1
#define _PIR6_U2IF_LENGTH                                   0x1
#define _PIR6_U2IF_MASK                                     0x40
#define _PIR6_U2EIF_POSN                                    0x7
#define _PIR6_U2EIF_POSITION                                0x7
#define _PIR6_U2EIF_SIZE                                    0x1
#define _PIR6_U2EIF_LENGTH                                  0x1
#define _PIR6_U2EIF_MASK                                    0x80

