garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// Register: PORTWIN1
#define PORTWIN1 PORTWIN1
extern volatile unsigned char           PORTWIN1            __at(0x49C);
#ifndef _LIB_BUILD
asm("PORTWIN1 equ 049Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN1bits_t;
extern volatile PORTWIN1bits_t PORTWIN1bits __at(0x49C);
// bitfield macros
#define _PORTWIN1_IN_POSN                                   0x0
#define _PORTWIN1_IN_POSITION                               0x0
#define _PORTWIN1_IN_SIZE                                   0x8
#define _PORTWIN1_IN_LENGTH                                 0x8
#define _PORTWIN1_IN_MASK                                   0xFF
#define _PORTWIN1_IN0_POSN                                  0x0
#define _PORTWIN1_IN0_POSITION                              0x0
#define _PORTWIN1_IN0_SIZE                                  0x1
#define _PORTWIN1_IN0_LENGTH                                0x1
#define _PORTWIN1_IN0_MASK                                  0x1
#define _PORTWIN1_IN1_POSN                                  0x1
#define _PORTWIN1_IN1_POSITION                              0x1
#define _PORTWIN1_IN1_SIZE                                  0x1
#define _PORTWIN1_IN1_LENGTH                                0x1
#define _PORTWIN1_IN1_MASK                                  0x2
#define _PORTWIN1_IN2_POSN                                  0x2
#define _PORTWIN1_IN2_POSITION                              0x2
#define _PORTWIN1_IN2_SIZE                                  0x1
#define _PORTWIN1_IN2_LENGTH                                0x1
#define _PORTWIN1_IN2_MASK                                  0x4

// Register: PORTWIN2
#define PORTWIN2 PORTWIN2
extern volatile unsigned char           PORTWIN2            __at(0x49D);
#ifndef _LIB_BUILD
asm("PORTWIN2 equ 049Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN2bits_t;
extern volatile PORTWIN2bits_t PORTWIN2bits __at(0x49D);
// bitfield macros
#define _PORTWIN2_IN_POSN                                   0x0
#define _PORTWIN2_IN_POSITION                               0x0
#define _PORTWIN2_IN_SIZE                                   0x8
#define _PORTWIN2_IN_LENGTH                                 0x8
#define _PORTWIN2_IN_MASK                                   0xFF
#define _PORTWIN2_IN0_POSN                                  0x0
#define _PORTWIN2_IN0_POSITION                              0x0
#define _PORTWIN2_IN0_SIZE                                  0x1
#define _PORTWIN2_IN0_LENGTH                                0x1
#define _PORTWIN2_IN0_MASK                                  0x1
#define _PORTWIN2_IN1_POSN                                  0x1
#define _PORTWIN2_IN1_POSITION                              0x1
#define _PORTWIN2_IN1_SIZE                                  0x1
#define _PORTWIN2_IN1_LENGTH                                0x1
#define _PORTWIN2_IN1_MASK                                  0x2
#define _PORTWIN2_IN2_POSN                                  0x2
#define _PORTWIN2_IN2_POSITION                              0x2
#define _PORTWIN2_IN2_SIZE                                  0x1
#define _PORTWIN2_IN2_LENGTH                                0x1
#define _PORTWIN2_IN2_MASK                                  0x4

// Register: PORTWIN3
#define PORTWIN3 PORTWIN3
extern volatile unsigned char           PORTWIN3            __at(0x49E);
#ifndef _LIB_BUILD
asm("PORTWIN3 equ 049Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN3bits_t;
extern volatile PORTWIN3bits_t PORTWIN3bits __at(0x49E);
// bitfield macros
#define _PORTWIN3_IN_POSN                                   0x0
#define _PORTWIN3_IN_POSITION                               0x0
#define _PORTWIN3_IN_SIZE                                   0x8
#define _PORTWIN3_IN_LENGTH                                 0x8
#define _PORTWIN3_IN_MASK                                   0xFF
#define _PORTWIN3_IN0_POSN                                  0x0
#define _PORTWIN3_IN0_POSITION                              0x0
#define _PORTWIN3_IN0_SIZE                                  0x1
#define _PORTWIN3_IN0_LENGTH                                0x1
#define _PORTWIN3_IN0_MASK                                  0x1
#define _PORTWIN3_IN1_POSN                                  0x1
#define _PORTWIN3_IN1_POSITION                              0x1
#define _PORTWIN3_IN1_SIZE                                  0x1
#define _PORTWIN3_IN1_LENGTH                                0x1
#define _PORTWIN3_IN1_MASK                                  0x2
#define _PORTWIN3_IN2_POSN                                  0x2
#define _PORTWIN3_IN2_POSITION                              0x2
#define _PORTWIN3_IN2_SIZE                                  0x1
#define _PORTWIN3_IN2_LENGTH                                0x1
#define _PORTWIN3_IN2_MASK                                  0x4

// Register: PORTWIN4
#define PORTWIN4 PORTWIN4
extern volatile unsigned char           PORTWIN4            __at(0x49F);
#ifndef _LIB_BUILD
asm("PORTWIN4 equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN4bits_t;
extern volatile PORTWIN4bits_t PORTWIN4bits __at(0x49F);
// bitfield macros
#define _PORTWIN4_IN_POSN                                   0x0
#define _PORTWIN4_IN_POSITION                               0x0
#define _PORTWIN4_IN_SIZE                                   0x8
#define _PORTWIN4_IN_LENGTH                                 0x8
#define _PORTWIN4_IN_MASK                                   0xFF
#define _PORTWIN4_IN0_POSN                                  0x0
#define _PORTWIN4_IN0_POSITION                              0x0
#define _PORTWIN4_IN0_SIZE                                  0x1
#define _PORTWIN4_IN0_LENGTH                                0x1
#define _PORTWIN4_IN0_MASK                                  0x1
#define _PORTWIN4_IN1_POSN                                  0x1
#define _PORTWIN4_IN1_POSITION                              0x1
#define _PORTWIN4_IN1_SIZE                                  0x1
#define _PORTWIN4_IN1_LENGTH                                0x1
#define _PORTWIN4_IN1_MASK                                  0x2
#define _PORTWIN4_IN2_POSN                                  0x2
#define _PORTWIN4_IN2_POSITION                              0x2
#define _PORTWIN4_IN2_SIZE                                  0x1
#define _PORTWIN4_IN2_LENGTH                                0x1
#define _PORTWIN4_IN2_MASK                                  0x4

// Register: PORTWIN5
#define PORTWIN5 PORTWIN5
extern volatile unsigned char           PORTWIN5            __at(0x4A0);
#ifndef _LIB_BUILD
asm("PORTWIN5 equ 04A0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN5bits_t;
extern volatile PORTWIN5bits_t PORTWIN5bits __at(0x4A0);
// bitfield macros
#define _PORTWIN5_IN_POSN                                   0x0
#define _PORTWIN5_IN_POSITION                               0x0
#define _PORTWIN5_IN_SIZE                                   0x8
#define _PORTWIN5_IN_LENGTH                                 0x8
#define _PORTWIN5_IN_MASK                                   0xFF
#define _PORTWIN5_IN0_POSN                                  0x0
#define _PORTWIN5_IN0_POSITION                              0x0
#define _PORTWIN5_IN0_SIZE                                  0x1
#define _PORTWIN5_IN0_LENGTH                                0x1
#define _PORTWIN5_IN0_MASK                                  0x1
#define _PORTWIN5_IN1_POSN                                  0x1
#define _PORTWIN5_IN1_POSITION                              0x1
#define _PORTWIN5_IN1_SIZE                                  0x1
#define _PORTWIN5_IN1_LENGTH                                0x1
#define _PORTWIN5_IN1_MASK                                  0x2
#define _PORTWIN5_IN2_POSN                                  0x2
#define _PORTWIN5_IN2_POSITION                              0x2
#define _PORTWIN5_IN2_SIZE                                  0x1
#define _PORTWIN5_IN2_LENGTH                                0x1
#define _PORTWIN5_IN2_MASK                                  0x4

// Register: PORTWIN6
#define PORTWIN6 PORTWIN6
extern volatile unsigned char           PORTWIN6            __at(0x4A1);
#ifndef _LIB_BUILD
asm("PORTWIN6 equ 04A1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN6bits_t;
extern volatile PORTWIN6bits_t PORTWIN6bits __at(0x4A1);
// bitfield macros
#define _PORTWIN6_IN_POSN                                   0x0
#define _PORTWIN6_IN_POSITION                               0x0
#define _PORTWIN6_IN_SIZE                                   0x8
#define _PORTWIN6_IN_LENGTH                                 0x8
#define _PORTWIN6_IN_MASK                                   0xFF
#define _PORTWIN6_IN0_POSN                                  0x0
#define _PORTWIN6_IN0_POSITION                              0x0
#define _PORTWIN6_IN0_SIZE                                  0x1
#define _PORTWIN6_IN0_LENGTH                                0x1
#define _PORTWIN6_IN0_MASK                                  0x1
#define _PORTWIN6_IN1_POSN                                  0x1
#define _PORTWIN6_IN1_POSITION                              0x1
#define _PORTWIN6_IN1_SIZE                                  0x1
#define _PORTWIN6_IN1_LENGTH                                0x1
#define _PORTWIN6_IN1_MASK                                  0x2
#define _PORTWIN6_IN2_POSN                                  0x2
#define _PORTWIN6_IN2_POSITION                              0x2
#define _PORTWIN6_IN2_SIZE                                  0x1
#define _PORTWIN6_IN2_LENGTH                                0x1
#define _PORTWIN6_IN2_MASK                                  0x4

// Register: PORTWIN7
#define PORTWIN7 PORTWIN7
extern volatile unsigned char           PORTWIN7            __at(0x4A2);
#ifndef _LIB_BUILD
asm("PORTWIN7 equ 04A2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
    };
} PORTWIN7bits_t;
extern volatile PORTWIN7bits_t PORTWIN7bits __at(0x4A2);
// bitfield macros
#define _PORTWIN7_IN_POSN                                   0x0
#define _PORTWIN7_IN_POSITION                               0x0
#define _PORTWIN7_IN_SIZE                                   0x8
#define _PORTWIN7_IN_LENGTH                                 0x8
#define _PORTWIN7_IN_MASK                                   0xFF
#define _PORTWIN7_IN0_POSN                                  0x0
#define _PORTWIN7_IN0_POSITION                              0x0
#define _PORTWIN7_IN0_SIZE                                  0x1
#define _PORTWIN7_IN0_LENGTH                                0x1
#define _PORTWIN7_IN0_MASK                                  0x1
#define _PORTWIN7_IN1_POSN                                  0x1
#define _PORTWIN7_IN1_POSITION                              0x1
#define _PORTWIN7_IN1_SIZE                                  0x1
#define _PORTWIN7_IN1_LENGTH                                0x1
#define _PORTWIN7_IN1_MASK                                  0x2
#define _PORTWIN7_IN2_POSN                                  0x2
#define _PORTWIN7_IN2_POSITION                              0x2
#define _PORTWIN7_IN2_SIZE                                  0x1
#define _PORTWIN7_IN2_LENGTH                                0x1
#define _PORTWIN7_IN2_MASK                                  0x4

// Register: PORTWCLK
#define PORTWCLK PORTWCLK
extern volatile unsigned char           PORTWCLK            __at(0x4A3);
#ifndef _LIB_BUILD
asm("PORTWCLK equ 04A3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned PWCLK                  :8;
    };
} PORTWCLKbits_t;
extern volatile PORTWCLKbits_t PORTWCLKbits __at(0x4A3);
// bitfield macros
#define _PORTWCLK_CLK_POSN                                  0x0
#define _PORTWCLK_CLK_POSITION                              0x0
#define _PORTWCLK_CLK_SIZE                                  0x8
#define _PORTWCLK_CLK_LENGTH                                0x8
#define _PORTWCLK_CLK_MASK                                  0xFF
#define _PORTWCLK_CLK0_POSN                                 0x0
#define _PORTWCLK_CLK0_POSITION                             0x0
#define _PORTWCLK_CLK0_SIZE                                 0x1
#define _PORTWCLK_CLK0_LENGTH                               0x1
#define _PORTWCLK_CLK0_MASK                                 0x1
#define _PORTWCLK_CLK1_POSN                                 0x1
#define _PORTWCLK_CLK1_POSITION                             0x1
#define _PORTWCLK_CLK1_SIZE                                 0x1
#define _PORTWCLK_CLK1_LENGTH                               0x1
#define _PORTWCLK_CLK1_MASK                                 0x2
#define _PORTWCLK_CLK2_POSN                                 0x2
#define _PORTWCLK_CLK2_POSITION                             0x2
#define _PORTWCLK_CLK2_SIZE                                 0x1
#define _PORTWCLK_CLK2_LENGTH                               0x1
#define _PORTWCLK_CLK2_MASK                                 0x4
#define _PORTWCLK_CLK3_POSN                                 0x3
#define _PORTWCLK_CLK3_POSITION                             0x3
#define _PORTWCLK_CLK3_SIZE                                 0x1
#define _PORTWCLK_CLK3_LENGTH                               0x1
#define _PORTWCLK_CLK3_MASK                                 0x8
#define _PORTWCLK_CLK4_POSN                                 0x4
#define _PORTWCLK_CLK4_POSITION                             0x4
#define _PORTWCLK_CLK4_SIZE                                 0x1
#define _PORTWCLK_CLK4_LENGTH                               0x1
#define _PORTWCLK_CLK4_MASK                                 0x10
#define _PORTWCLK_PWCLK_POSN                                0x0
#define _PORTWCLK_PWCLK_POSITION                            0x0
#define _PORTWCLK_PWCLK_SIZE                                0x8
#define _PORTWCLK_PWCLK_LENGTH                              0x8
#define _PORTWCLK_PWCLK_MASK                                0xFF

// Register: PORTWDF
#define PORTWDF PORTWDF
extern volatile unsigned char           PORTWDF             __at(0x4A4);
#ifndef _LIB_BUILD
asm("PORTWDF equ 04A4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DF0                    :1;
        unsigned DF1                    :1;
        unsigned DF2                    :1;
        unsigned DF3                    :1;
        unsigned DF4                    :1;
        unsigned DF5                    :1;
        unsigned DF6                    :1;
        unsigned DF7                    :1;
    };
    struct {
        unsigned PWDF0                  :1;
        unsigned PWDF1                  :1;
        unsigned PWDF2                  :1;
        unsigned PWDF3                  :1;
        unsigned PWDF4                  :1;
        unsigned PWDF5                  :1;
        unsigned PWDF6                  :1;
        unsigned PWDF7                  :1;
    };
    struct {
        unsigned DF                     :8;
    };
    struct {
        unsigned PWDF                   :8;
    };
} PORTWDFbits_t;
extern volatile PORTWDFbits_t PORTWDFbits __at(0x4A4);
// bitfield macros
#define _PORTWDF_DF0_POSN                                   0x0
#define _PORTWDF_DF0_POSITION                               0x0
#define _PORTWDF_DF0_SIZE                                   0x1
#define _PORTWDF_DF0_LENGTH                                 0x1
#define _PORTWDF_DF0_MASK                                   0x1
#define _PORTWDF_DF1_POSN                                   0x1
#define _PORTWDF_DF1_POSITION                               0x1
#define _PORTWDF_DF1_SIZE                                   0x1
#define _PORTWDF_DF1_LENGTH                                 0x1
#define _PORTWDF_DF1_MASK                                   0x2
#define _PORTWDF_DF2_POSN                                   0x2
#define _PORTWDF_DF2_POSITION                               0x2
#define _PORTWDF_DF2_SIZE                                   0x1
#define _PORTWDF_DF2_LENGTH                                 0x1
#define _PORTWDF_DF2_MASK                                   0x4
#define _PORTWDF_DF3_POSN                                   0x3
#define _PORTWDF_DF3_POSITION                               0x3
#define _PORTWDF_DF3_SIZE                                   0x1
#define _PORTWDF_DF3_LENGTH                                 0x1
#define _PORTWDF_DF3_MASK                                   0x8
#define _PORTWDF_DF4_POSN                                   0x4
#define _PORTWDF_DF4_POSITION                               0x4
#define _PORTWDF_DF4_SIZE                                   0x1
#define _PORTWDF_DF4_LENGTH                                 0x1
#define _PORTWDF_DF4_MASK                                   0x10
#define _PORTWDF_DF5_POSN                                   0x5
#define _PORTWDF_DF5_POSITION                               0x5
#define _PORTWDF_DF5_SIZE                                   0x1
#define _PORTWDF_DF5_LENGTH                                 0x1
#define _PORTWDF_DF5_MASK                                   0x20
#define _PORTWDF_DF6_POSN                                   0x6
#define _PORTWDF_DF6_POSITION                               0x6
#define _PORTWDF_DF6_SIZE                                   0x1
#define _PORTWDF_DF6_LENGTH                                 0x1
#define _PORTWDF_DF6_MASK                                   0x40
#define _PORTWDF_DF7_POSN                                   0x7
#define _PORTWDF_DF7_POSITION                               0x7
#define _PORTWDF_DF7_SIZE                                   0x1
#define _PORTWDF_DF7_LENGTH                                 0x1
#define _PORTWDF_DF7_MASK                                   0x80
#define _PORTWDF_PWDF0_POSN                                 0x0
#define _PORTWDF_PWDF0_POSITION                             0x0
#define _PORTWDF_PWDF0_SIZE                                 0x1
#define _PORTWDF_PWDF0_LENGTH                               0x1
#define _PORTWDF_PWDF0_MASK                                 0x1
#define _PORTWDF_PWDF1_POSN                                 0x1
#define _PORTWDF_PWDF1_POSITION                             0x1
#define _PORTWDF_PWDF1_SIZE                                 0x1
#define _PORTWDF_PWDF1_LENGTH                               0x1
#define _PORTWDF_PWDF1_MASK                                 0x2
#define _PORTWDF_PWDF2_POSN                                 0x2
#define _PORTWDF_PWDF2_POSITION                             0x2
#define _PORTWDF_PWDF2_SIZE                                 0x1
#define _PORTWDF_PWDF2_LENGTH                               0x1
#define _PORTWDF_PWDF2_MASK                                 0x4
#define _PORTWDF_PWDF3_POSN                                 0x3
#define _PORTWDF_PWDF3_POSITION                             0x3
#define _PORTWDF_PWDF3_SIZE                                 0x1
#define _PORTWDF_PWDF3_LENGTH                               0x1
#define _PORTWDF_PWDF3_MASK                                 0x8
#define _PORTWDF_PWDF4_POSN                                 0x4
#define _PORTWDF_PWDF4_POSITION                             0x4
#define _PORTWDF_PWDF4_SIZE                                 0x1
#define _PORTWDF_PWDF4_LENGTH                               0x1
#define _PORTWDF_PWDF4_MASK                                 0x10
#define _PORTWDF_PWDF5_POSN                                 0x5
#define _PORTWDF_PWDF5_POSITION                             0x5
#define _PORTWDF_PWDF5_SIZE                                 0x1
#define _PORTWDF_PWDF5_LENGTH                               0x1
#define _PORTWDF_PWDF5_MASK                                 0x20
#define _PORTWDF_PWDF6_POSN                                 0x6
#define _PORTWDF_PWDF6_POSITION                             0x6
#define _PORTWDF_PWDF6_SIZE                                 0x1
#define _PORTWDF_PWDF6_LENGTH                               0x1
#define _PORTWDF_PWDF6_MASK                                 0x40
#define _PORTWDF_PWDF7_POSN                                 0x7
#define _PORTWDF_PWDF7_POSITION                             0x7
#define _PORTWDF_PWDF7_SIZE                                 0x1
#define _PORTWDF_PWDF7_LENGTH                               0x1
#define _PORTWDF_PWDF7_MASK                                 0x80
#define _PORTWDF_DF_POSN                                    0x0
#define _PORTWDF_DF_POSITION                                0x0
#define _PORTWDF_DF_SIZE                                    0x8
#define _PORTWDF_DF_LENGTH                                  0x8
#define _PORTWDF_DF_MASK                                    0xFF
#define _PORTWDF_PWDF_POSN                                  0x0
#define _PORTWDF_PWDF_POSITION                              0x0
#define _PORTWDF_PWDF_SIZE                                  0x8
#define _PORTWDF_PWDF_LENGTH                                0x8
#define _PORTWDF_PWDF_MASK                                  0xFF

// Register: PORTWCON
#define PORTWCON PORTWCON
extern volatile unsigned char           PORTWCON            __at(0x4A5);
#ifndef _LIB_BUILD
asm("PORTWCON equ 04A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKEN                  :1;
    };
} PORTWCONbits_t;
extern volatile PORTWCONbits_t PORTWCONbits __at(0x4A5);
// bitfield macros
#define _PORTWCON_CLKEN_POSN                                0x0
#define _PORTWCON_CLKEN_POSITION                            0x0
#define _PORTWCON_CLKEN_SIZE                                0x1
#define _PORTWCON_CLKEN_LENGTH                              0x1
#define _PORTWCON_CLKEN_MASK                                0x1

