garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0xD3A);	// @ (0x1A7 * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0xD3B);	// @ (0x1A7 * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0xD3C);	// @ (0x1A7 * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0xD3D);	// @ (0x1A7 * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0xD40);	// @ (0x1A8 * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0xD41);	// @ (0x1A8 * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0xD42);	// @ (0x1A8 * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0xD43);	// @ (0x1A8 * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0xD44);	// @ (0x1A8 * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0xD45);	// @ (0x1A8 * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0xD48);	// @ (0x1A9 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0xD49);	// @ (0x1A9 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0xD4A);	// @ (0x1A9 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0xD4B);	// @ (0x1A9 * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0xD4C);	// @ (0x1A9 * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0xD4D);	// @ (0x1A9 * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0xD50);	// @ (0x1AA * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0xD51);	// @ (0x1AA * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0xD52);	// @ (0x1AA * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0xD53);	// @ (0x1AA * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0xD54);	// @ (0x1AA * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0xD55);	// @ (0x1AA * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// I3C1PIE1<DACHIE>
extern volatile __bit                   DACHIE              __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 DACHIE_bit          _BIT_ACCESS(I3C1PIE1,6)
// I3C1PIR1<DACHIF>
extern volatile __bit                   DACHIF              __at(0x45E);	// @ (0x8B * 8 + 6)
#define                                 DACHIF_bit          _BIT_ACCESS(I3C1PIR1,6)
// I3C1PIE0<DADRIE>
extern volatile __bit                   DADRIE              __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 DADRIE_bit          _BIT_ACCESS(I3C1PIE0,2)
// I3C1PIR0<DADRIF>
extern volatile __bit                   DADRIF              __at(0x452);	// @ (0x8A * 8 + 2)
#define                                 DADRIF_bit          _BIT_ACCESS(I3C1PIR0,2)
// I2C1STAT0<DATA>
extern volatile __bit                   DATA                __at(0xF23);	// @ (0x1E4 * 8 + 3)
#define                                 DATA_bit            _BIT_ACCESS(I2C1STAT0,3)
// CRCDATAL<DATA0>
extern volatile __bit                   DATA0               __at(0x300);	// @ (0x60 * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATAL,0)
// CRCDATAL<DATA1>
extern volatile __bit                   DATA1               __at(0x301);	// @ (0x60 * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATAL,1)
// CRCDATAH<DATA10>
extern volatile __bit                   DATA10              __at(0x30A);	// @ (0x61 * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATAH,2)
// CRCDATAH<DATA11>
extern volatile __bit                   DATA11              __at(0x30B);	// @ (0x61 * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATAH,3)
// CRCDATAH<DATA12>
extern volatile __bit                   DATA12              __at(0x30C);	// @ (0x61 * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATAH,4)
// CRCDATAH<DATA13>
extern volatile __bit                   DATA13              __at(0x30D);	// @ (0x61 * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATAH,5)
// CRCDATAH<DATA14>
extern volatile __bit                   DATA14              __at(0x30E);	// @ (0x61 * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0x30F);	// @ (0x61 * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0x310);	// @ (0x62 * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0x311);	// @ (0x62 * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0x312);	// @ (0x62 * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0x313);	// @ (0x62 * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0x302);	// @ (0x60 * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0x314);	// @ (0x62 * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0x315);	// @ (0x62 * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0x316);	// @ (0x62 * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0x317);	// @ (0x62 * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0x318);	// @ (0x63 * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0x319);	// @ (0x63 * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0x31A);	// @ (0x63 * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0x31B);	// @ (0x63 * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0x31C);	// @ (0x63 * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0x303);	// @ (0x60 * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0x31E);	// @ (0x63 * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0x31F);	// @ (0x63 * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0x304);	// @ (0x60 * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0x305);	// @ (0x60 * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0x306);	// @ (0x60 * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0x307);	// @ (0x60 * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0x308);	// @ (0x61 * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0x309);	// @ (0x61 * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0xCE0);	// @ (0x19C * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0xCE1);	// @ (0x19C * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0xCE2);	// @ (0x19C * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0xCE3);	// @ (0x19C * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0xCE4);	// @ (0x19C * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0xCE5);	// @ (0x19C * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0xCD8);	// @ (0x19B * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0xCD9);	// @ (0x19B * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0xCDA);	// @ (0x19B * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0xCDB);	// @ (0x19B * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0xCDC);	// @ (0x19B * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0xCDD);	// @ (0x19B * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x803);	// @ (0x100 * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x804);	// @ (0x100 * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// DMAnDCNTL<DCNT0>
extern volatile __bit                   DCNT0               __at(0x210);	// @ (0x42 * 8 + 0)
#define                                 DCNT0_bit           _BIT_ACCESS(DMAnDCNTL,0)
// DMAnDCNTL<DCNT1>
extern volatile __bit                   DCNT1               __at(0x211);	// @ (0x42 * 8 + 1)
#define                                 DCNT1_bit           _BIT_ACCESS(DMAnDCNTL,1)
// DMAnDCNTH<DCNT10>
extern volatile __bit                   DCNT10              __at(0x21A);	// @ (0x43 * 8 + 2)
#define                                 DCNT10_bit          _BIT_ACCESS(DMAnDCNTH,2)
// DMAnDCNTH<DCNT11>
extern volatile __bit                   DCNT11              __at(0x21B);	// @ (0x43 * 8 + 3)
#define                                 DCNT11_bit          _BIT_ACCESS(DMAnDCNTH,3)
// DMAnDCNTL<DCNT2>
extern volatile __bit                   DCNT2               __at(0x212);	// @ (0x42 * 8 + 2)
#define                                 DCNT2_bit           _BIT_ACCESS(DMAnDCNTL,2)
// DMAnDCNTL<DCNT3>
extern volatile __bit                   DCNT3               __at(0x213);	// @ (0x42 * 8 + 3)
#define                                 DCNT3_bit           _BIT_ACCESS(DMAnDCNTL,3)
// DMAnDCNTL<DCNT4>
extern volatile __bit                   DCNT4               __at(0x214);	// @ (0x42 * 8 + 4)
#define                                 DCNT4_bit           _BIT_ACCESS(DMAnDCNTL,4)
// DMAnDCNTL<DCNT5>
extern volatile __bit                   DCNT5               __at(0x215);	// @ (0x42 * 8 + 5)
#define                                 DCNT5_bit           _BIT_ACCESS(DMAnDCNTL,5)
// DMAnDCNTL<DCNT6>
extern volatile __bit                   DCNT6               __at(0x216);	// @ (0x42 * 8 + 6)
#define                                 DCNT6_bit           _BIT_ACCESS(DMAnDCNTL,6)
// DMAnDCNTL<DCNT7>
extern volatile __bit                   DCNT7               __at(0x217);	// @ (0x42 * 8 + 7)
#define                                 DCNT7_bit           _BIT_ACCESS(DMAnDCNTL,7)
// DMAnDCNTH<DCNT8>
extern volatile __bit                   DCNT8               __at(0x218);	// @ (0x43 * 8 + 0)
#define                                 DCNT8_bit           _BIT_ACCESS(DMAnDCNTH,0)
// DMAnDCNTH<DCNT9>
extern volatile __bit                   DCNT9               __at(0x219);	// @ (0x43 * 8 + 1)
#define                                 DCNT9_bit           _BIT_ACCESS(DMAnDCNTH,1)
// PORTWDF<DF0>
extern volatile __bit                   DF0                 __at(0x2520);	// @ (0x4A4 * 8 + 0)
#define                                 DF0_bit             _BIT_ACCESS(PORTWDF,0)
// PORTWDF<DF1>
extern volatile __bit                   DF1                 __at(0x2521);	// @ (0x4A4 * 8 + 1)
#define                                 DF1_bit             _BIT_ACCESS(PORTWDF,1)
// PORTWDF<DF2>
extern volatile __bit                   DF2                 __at(0x2522);	// @ (0x4A4 * 8 + 2)
#define                                 DF2_bit             _BIT_ACCESS(PORTWDF,2)
// PORTWDF<DF3>
extern volatile __bit                   DF3                 __at(0x2523);	// @ (0x4A4 * 8 + 3)
#define                                 DF3_bit             _BIT_ACCESS(PORTWDF,3)
// PORTWDF<DF4>
extern volatile __bit                   DF4                 __at(0x2524);	// @ (0x4A4 * 8 + 4)
#define                                 DF4_bit             _BIT_ACCESS(PORTWDF,4)
// PORTWDF<DF5>
extern volatile __bit                   DF5                 __at(0x2525);	// @ (0x4A4 * 8 + 5)
#define                                 DF5_bit             _BIT_ACCESS(PORTWDF,5)
// PORTWDF<DF6>
extern volatile __bit                   DF6                 __at(0x2526);	// @ (0x4A4 * 8 + 6)
#define                                 DF6_bit             _BIT_ACCESS(PORTWDF,6)
// PORTWDF<DF7>
extern volatile __bit                   DF7                 __at(0x2527);	// @ (0x4A4 * 8 + 7)
#define                                 DF7_bit             _BIT_ACCESS(PORTWDF,7)
// DMAnCON0<DGO>
extern volatile __bit                   DGO                 __at(0x2A5);	// @ (0x54 * 8 + 5)
#define                                 DGO_bit             _BIT_ACCESS(DMAnCON0,5)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x800);	// @ (0x100 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x801);	// @ (0x100 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x802);	// @ (0x100 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0x350);	// @ (0x6A * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0x351);	// @ (0x6A * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0x352);	// @ (0x6A * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0x353);	// @ (0x6A * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
extern volatile __bit                   DLEN4               __at(0x354);	// @ (0x6A * 8 + 4)
#define                                 DLEN4_bit           _BIT_ACCESS(CRCCON2,4)
// PIE0<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x239F);	// @ (0x473 * 8 + 7)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE0,7)
// PIR0<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x234F);	// @ (0x469 * 8 + 7)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR0,7)
// IPR0<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x23EF);	// @ (0x47D * 8 + 7)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR0,7)
// PIE0<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x239D);	// @ (0x473 * 8 + 5)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE0,5)
// PIR0<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x234D);	// @ (0x469 * 8 + 5)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR0,5)
// IPR0<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x23ED);	// @ (0x47D * 8 + 5)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR0,5)
// PMD0<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x1800);	// @ (0x300 * 8 + 0)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD0,0)
// PIE0<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x239E);	// @ (0x473 * 8 + 6)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE0,6)
// PIR0<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x234E);	// @ (0x469 * 8 + 6)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR0,6)
// IPR0<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x23EE);	// @ (0x47D * 8 + 6)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR0,6)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x1D8);	// @ (0x3B * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x1D9);	// @ (0x3B * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x1DA);	// @ (0x3B * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// PIE0<DMA1SCNTIE>
extern volatile __bit                   DMA1SCNTIE          __at(0x239C);	// @ (0x473 * 8 + 4)
#define                                 DMA1SCNTIE_bit      _BIT_ACCESS(PIE0,4)
// PIR0<DMA1SCNTIF>
extern volatile __bit                   DMA1SCNTIF          __at(0x234C);	// @ (0x469 * 8 + 4)
#define                                 DMA1SCNTIF_bit      _BIT_ACCESS(PIR0,4)
// IPR0<DMA1SCNTIP>
extern volatile __bit                   DMA1SCNTIP          __at(0x23EC);	// @ (0x47D * 8 + 4)
#define                                 DMA1SCNTIP_bit      _BIT_ACCESS(IPR0,4)
// PIE1<DMA2AIE>
extern volatile __bit                   DMA2AIE             __at(0x23A3);	// @ (0x474 * 8 + 3)
#define                                 DMA2AIE_bit         _BIT_ACCESS(PIE1,3)
// PIR1<DMA2AIF>
extern volatile __bit                   DMA2AIF             __at(0x2353);	// @ (0x46A * 8 + 3)
#define                                 DMA2AIF_bit         _BIT_ACCESS(PIR1,3)
// IPR1<DMA2AIP>
extern volatile __bit                   DMA2AIP             __at(0x23F3);	// @ (0x47E * 8 + 3)
#define                                 DMA2AIP_bit         _BIT_ACCESS(IPR1,3)
// PIE1<DMA2DCNTIE>
extern volatile __bit                   DMA2DCNTIE          __at(0x23A1);	// @ (0x474 * 8 + 1)
#define                                 DMA2DCNTIE_bit      _BIT_ACCESS(PIE1,1)
// PIR1<DMA2DCNTIF>
extern volatile __bit                   DMA2DCNTIF          __at(0x2351);	// @ (0x46A * 8 + 1)
