garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x10F5);	// @ (0x21E * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0x10F6);	// @ (0x21E * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x10F7);	// @ (0x21E * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x10EA);	// @ (0x21D * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x10EB);	// @ (0x21D * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x10EC);	// @ (0x21D * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x10ED);	// @ (0x21D * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x10EE);	// @ (0x21D * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x10EF);	// @ (0x21D * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x10F0);	// @ (0x21E * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x10F1);	// @ (0x21E * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x117A);	// @ (0x22F * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// I2C1CON3<FME0>
extern volatile __bit                   FME0                __at(0xF4A);	// @ (0x1E9 * 8 + 2)
#define                                 FME0_bit            _BIT_ACCESS(I2C1CON3,2)
// I2C1CON3<FME1>
extern volatile __bit                   FME1                __at(0xF4B);	// @ (0x1E9 * 8 + 3)
#define                                 FME1_bit            _BIT_ACCESS(I2C1CON3,3)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x400);	// @ (0x80 * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x401);	// @ (0x80 * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x402);	// @ (0x80 * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x403);	// @ (0x80 * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// FSCMCON<FSCMFEV>
extern volatile __bit                   FSCMFEV             __at(0x410);	// @ (0x82 * 8 + 0)
#define                                 FSCMFEV_bit         _BIT_ACCESS(FSCMCON,0)
// FSCMCON<FSCMFFI>
extern volatile __bit                   FSCMFFI             __at(0x411);	// @ (0x82 * 8 + 1)
#define                                 FSCMFFI_bit         _BIT_ACCESS(FSCMCON,1)
// FSCMCON<FSCMPEV>
extern volatile __bit                   FSCMPEV             __at(0x412);	// @ (0x82 * 8 + 2)
#define                                 FSCMPEV_bit         _BIT_ACCESS(FSCMCON,2)
// FSCMCON<FSCMPFI>
extern volatile __bit                   FSCMPFI             __at(0x413);	// @ (0x82 * 8 + 3)
#define                                 FSCMPFI_bit         _BIT_ACCESS(FSCMCON,3)
// FSCMCON<FSCMSEV>
extern volatile __bit                   FSCMSEV             __at(0x414);	// @ (0x82 * 8 + 4)
#define                                 FSCMSEV_bit         _BIT_ACCESS(FSCMCON,4)
// FSCMCON<FSCMSFI>
extern volatile __bit                   FSCMSFI             __at(0x415);	// @ (0x82 * 8 + 5)
#define                                 FSCMSFI_bit         _BIT_ACCESS(FSCMCON,5)
// SPI1CON1<FST>
extern volatile __bit                   FST                 __at(0xEE4);	// @ (0x1DC * 8 + 4)
#define                                 FST_bit             _BIT_ACCESS(SPI1CON1,4)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x340);	// @ (0x68 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x100F);	// @ (0x201 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD4<FVRMD>
extern volatile __bit                   FVRMD               __at(0x1821);	// @ (0x304 * 8 + 1)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD4,1)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x100E);	// @ (0x201 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CLCnGLS0<G1D1N>
extern volatile __bit                   G1D1N               __at(0xD58);	// @ (0x1AB * 8 + 0)
#define                                 G1D1N_bit           _BIT_ACCESS(CLCnGLS0,0)
// CLCnGLS0<G1D1T>
extern volatile __bit                   G1D1T               __at(0xD59);	// @ (0x1AB * 8 + 1)
#define                                 G1D1T_bit           _BIT_ACCESS(CLCnGLS0,1)
// CLCnGLS0<G1D2N>
extern volatile __bit                   G1D2N               __at(0xD5A);	// @ (0x1AB * 8 + 2)
#define                                 G1D2N_bit           _BIT_ACCESS(CLCnGLS0,2)
// CLCnGLS0<G1D2T>
extern volatile __bit                   G1D2T               __at(0xD5B);	// @ (0x1AB * 8 + 3)
#define                                 G1D2T_bit           _BIT_ACCESS(CLCnGLS0,3)
// CLCnGLS0<G1D3N>
extern volatile __bit                   G1D3N               __at(0xD5C);	// @ (0x1AB * 8 + 4)
#define                                 G1D3N_bit           _BIT_ACCESS(CLCnGLS0,4)
// CLCnGLS0<G1D3T>
extern volatile __bit                   G1D3T               __at(0xD5D);	// @ (0x1AB * 8 + 5)
#define                                 G1D3T_bit           _BIT_ACCESS(CLCnGLS0,5)
// CLCnGLS0<G1D4N>
extern volatile __bit                   G1D4N               __at(0xD5E);	// @ (0x1AB * 8 + 6)
#define                                 G1D4N_bit           _BIT_ACCESS(CLCnGLS0,6)
// CLCnGLS0<G1D4T>
extern volatile __bit                   G1D4T               __at(0xD5F);	// @ (0x1AB * 8 + 7)
#define                                 G1D4T_bit           _BIT_ACCESS(CLCnGLS0,7)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CLCnPOL<G1POL>
extern volatile __bit                   G1POL               __at(0xD30);	// @ (0x1A6 * 8 + 0)
#define                                 G1POL_bit           _BIT_ACCESS(CLCnPOL,0)
// CLCnGLS1<G2D1N>
extern volatile __bit                   G2D1N               __at(0xD60);	// @ (0x1AC * 8 + 0)
#define                                 G2D1N_bit           _BIT_ACCESS(CLCnGLS1,0)
// CLCnGLS1<G2D1T>
extern volatile __bit                   G2D1T               __at(0xD61);	// @ (0x1AC * 8 + 1)
#define                                 G2D1T_bit           _BIT_ACCESS(CLCnGLS1,1)
// CLCnGLS1<G2D2N>
extern volatile __bit                   G2D2N               __at(0xD62);	// @ (0x1AC * 8 + 2)
#define                                 G2D2N_bit           _BIT_ACCESS(CLCnGLS1,2)
// CLCnGLS1<G2D2T>
extern volatile __bit                   G2D2T               __at(0xD63);	// @ (0x1AC * 8 + 3)
#define                                 G2D2T_bit           _BIT_ACCESS(CLCnGLS1,3)
// CLCnGLS1<G2D3N>
extern volatile __bit                   G2D3N               __at(0xD64);	// @ (0x1AC * 8 + 4)
#define                                 G2D3N_bit           _BIT_ACCESS(CLCnGLS1,4)
// CLCnGLS1<G2D3T>
extern volatile __bit                   G2D3T               __at(0xD65);	// @ (0x1AC * 8 + 5)
#define                                 G2D3T_bit           _BIT_ACCESS(CLCnGLS1,5)
// CLCnGLS1<G2D4N>
extern volatile __bit                   G2D4N               __at(0xD66);	// @ (0x1AC * 8 + 6)
#define                                 G2D4N_bit           _BIT_ACCESS(CLCnGLS1,6)
// CLCnGLS1<G2D4T>
extern volatile __bit                   G2D4T               __at(0xD67);	// @ (0x1AC * 8 + 7)
#define                                 G2D4T_bit           _BIT_ACCESS(CLCnGLS1,7)
// CLCnPOL<G2POL>
extern volatile __bit                   G2POL               __at(0xD31);	// @ (0x1A6 * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLCnPOL,1)
// CLCnGLS2<G3D1N>
extern volatile __bit                   G3D1N               __at(0xD68);	// @ (0x1AD * 8 + 0)
#define                                 G3D1N_bit           _BIT_ACCESS(CLCnGLS2,0)
// CLCnGLS2<G3D1T>
extern volatile __bit                   G3D1T               __at(0xD69);	// @ (0x1AD * 8 + 1)
#define                                 G3D1T_bit           _BIT_ACCESS(CLCnGLS2,1)
// CLCnGLS2<G3D2N>
extern volatile __bit                   G3D2N               __at(0xD6A);	// @ (0x1AD * 8 + 2)
#define                                 G3D2N_bit           _BIT_ACCESS(CLCnGLS2,2)
// CLCnGLS2<G3D2T>
extern volatile __bit                   G3D2T               __at(0xD6B);	// @ (0x1AD * 8 + 3)
#define                                 G3D2T_bit           _BIT_ACCESS(CLCnGLS2,3)
// CLCnGLS2<G3D3N>
extern volatile __bit                   G3D3N               __at(0xD6C);	// @ (0x1AD * 8 + 4)
#define                                 G3D3N_bit           _BIT_ACCESS(CLCnGLS2,4)
// CLCnGLS2<G3D3T>
extern volatile __bit                   G3D3T               __at(0xD6D);	// @ (0x1AD * 8 + 5)
#define                                 G3D3T_bit           _BIT_ACCESS(CLCnGLS2,5)
// CLCnGLS2<G3D4N>
extern volatile __bit                   G3D4N               __at(0xD6E);	// @ (0x1AD * 8 + 6)
#define                                 G3D4N_bit           _BIT_ACCESS(CLCnGLS2,6)
// CLCnGLS2<G3D4T>
extern volatile __bit                   G3D4T               __at(0xD6F);	// @ (0x1AD * 8 + 7)
#define                                 G3D4T_bit           _BIT_ACCESS(CLCnGLS2,7)
// CLCnPOL<G3POL>
extern volatile __bit                   G3POL               __at(0xD32);	// @ (0x1A6 * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLCnPOL,2)
// CLCnGLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0xD70);	// @ (0x1AE * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLCnGLS3,0)
// CLCnGLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0xD71);	// @ (0x1AE * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLCnGLS3,1)
// CLCnGLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0xD72);	// @ (0x1AE * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLCnGLS3,2)
// CLCnGLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0xD73);	// @ (0x1AE * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLCnGLS3,3)
// CLCnGLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0xD74);	// @ (0x1AE * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLCnGLS3,4)
// CLCnGLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0xD75);	// @ (0x1AE * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLCnGLS3,5)
// CLCnGLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0xD76);	// @ (0x1AE * 8 + 6)
#define                                 G4D4N_bit           _BIT_ACCESS(CLCnGLS3,6)
// CLCnGLS3<G4D4T>
extern volatile __bit                   G4D4T               __at(0xD77);	// @ (0x1AE * 8 + 7)
#define                                 G4D4T_bit           _BIT_ACCESS(CLCnGLS3,7)
// CLCnPOL<G4POL>
extern volatile __bit                   G4POL               __at(0xD33);	// @ (0x1A6 * 8 + 3)
#define                                 G4POL_bit           _BIT_ACCESS(CLCnPOL,3)
// I2C1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0xF46);	// @ (0x1E8 * 8 + 6)
#define                                 GCEN_bit            _BIT_ACCESS(I2C1CON2,6)
// T1GCON<GE>
extern volatile __bit                   GE                  __at(0x857);	// @ (0x10A * 8 + 7)
#define                                 GE_bit              _BIT_ACCESS(T1GCON,7)
// T1GCON<GGO>
extern volatile __bit                   GGO                 __at(0x853);	// @ (0x10A * 8 + 3)
#define                                 GGO_bit             _BIT_ACCESS(T1GCON,3)
// T1GCON<GGO_NOT_DONE>
extern volatile __bit                   GGO_NOT_DONE        __at(0x853);	// @ (0x10A * 8 + 3)
#define                                 GGO_NOT_DONE_bit    _BIT_ACCESS(T1GCON,3)
// T1GCON<GGO_nDONE>
extern volatile __bit                   GGO_nDONE           __at(0x853);	// @ (0x10A * 8 + 3)
#define                                 GGO_nDONE_bit       _BIT_ACCESS(T1GCON,3)
// INTCON0<GIE>
extern volatile __bit                   GIE                 __at(0x230F);	// @ (0x461 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEH>
extern volatile __bit                   GIEH                __at(0x230F);	// @ (0x461 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEL>
extern volatile __bit                   GIEL                __at(0x230E);	// @ (0x461 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON0,6)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x1178);	// @ (0x22F * 8 + 0)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,0)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x1178);	// @ (0x22F * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// T1GCON<GSPM>
extern volatile __bit                   GSPM                __at(0x854);	// @ (0x10A * 8 + 4)
#define                                 GSPM_bit            _BIT_ACCESS(T1GCON,4)
// T1GATE<GSS0>
extern volatile __bit                   GSS0                __at(0x858);	// @ (0x10B * 8 + 0)
#define                                 GSS0_bit            _BIT_ACCESS(T1GATE,0)
// T1GATE<GSS1>
extern volatile __bit                   GSS1                __at(0x859);	// @ (0x10B * 8 + 1)
#define                                 GSS1_bit            _BIT_ACCESS(T1GATE,1)
// T1GATE<GSS2>
extern volatile __bit                   GSS2                __at(0x85A);	// @ (0x10B * 8 + 2)
#define                                 GSS2_bit            _BIT_ACCESS(T1GATE,2)
// T1GATE<GSS3>
extern volatile __bit                   GSS3                __at(0x85B);	// @ (0x10B * 8 + 3)
#define                                 GSS3_bit            _BIT_ACCESS(T1GATE,3)
// T1GCON<GTM>
extern volatile __bit                   GTM                 __at(0x855);	// @ (0x10A * 8 + 5)
#define                                 GTM_bit             _BIT_ACCESS(T1GCON,5)
// T1GCON<GVAL>
extern volatile __bit                   GVAL                __at(0x852);	// @ (0x10A * 8 + 2)
#define                                 GVAL_bit            _BIT_ACCESS(T1GCON,2)
// SCANHADRL<HADR0>
extern volatile __bit                   HADR0               __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 HADR0_bit           _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<HADR1>
extern volatile __bit                   HADR1               __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 HADR1_bit           _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<HADR10>
extern volatile __bit                   HADR10              __at(0x37A);	// @ (0x6F * 8 + 2)
#define                                 HADR10_bit          _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<HADR11>
extern volatile __bit                   HADR11              __at(0x37B);	// @ (0x6F * 8 + 3)
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x37C);	// @ (0x6F * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x37D);	// @ (0x6F * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x37E);	// @ (0x6F * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x37F);	// @ (0x6F * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<HADR16>
extern volatile __bit                   HADR16              __at(0x380);	// @ (0x70 * 8 + 0)
#define                                 HADR16_bit          _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<HADR17>
extern volatile __bit                   HADR17              __at(0x381);	// @ (0x70 * 8 + 1)
#define                                 HADR17_bit          _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<HADR18>
extern volatile __bit                   HADR18              __at(0x382);	// @ (0x70 * 8 + 2)
#define                                 HADR18_bit          _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<HADR19>
extern volatile __bit                   HADR19              __at(0x383);	// @ (0x70 * 8 + 3)
#define                                 HADR19_bit          _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<HADR2>
extern volatile __bit                   HADR2               __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 HADR2_bit           _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<HADR20>
extern volatile __bit                   HADR20              __at(0x384);	// @ (0x70 * 8 + 4)
#define                                 HADR20_bit          _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<HADR21>
extern volatile __bit                   HADR21              __at(0x385);	// @ (0x70 * 8 + 5)
#define                                 HADR21_bit          _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x374);	// @ (0x6E * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x375);	// @ (0x6E * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x376);	// @ (0x6E * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x377);	// @ (0x6E * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x378);	// @ (0x6F * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x379);	// @ (0x6F * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// I3C1FEAT<HDRCAP>
extern volatile __bit                   HDRCAP              __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 HDRCAP_bit          _BIT_ACCESS(I3C1FEAT,1)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x3F6);	// @ (0x7E * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x3EE);	// @ (0x7D * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// I3C1FEAT<HJCAP>
extern volatile __bit                   HJCAP               __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 HJCAP_bit           _BIT_ACCESS(I3C1FEAT,0)
// I3C1ERRIE0<HJEIE>
extern volatile __bit                   HJEIE               __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 HJEIE_bit           _BIT_ACCESS(I3C1ERRIE0,4)
// I3C1ERRIR0<HJEIF>
extern volatile __bit                   HJEIF               __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 HJEIF_bit           _BIT_ACCESS(I3C1ERRIR0,4)
// I3C1EC<HJEN>
extern volatile __bit                   HJEN                __at(0x4E3);	// @ (0x9C * 8 + 3)
#define                                 HJEN_bit            _BIT_ACCESS(I3C1EC,3)
// I3C1CON0<HJREQ>
extern volatile __bit                   HJREQ               __at(0x419);	// @ (0x83 * 8 + 1)
#define                                 HJREQ_bit           _BIT_ACCESS(I3C1CON0,1)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x1017);	// @ (0x202 * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE9<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x23E5);	// @ (0x47C * 8 + 5)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE9,5)
// PIR9<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x2395);	// @ (0x472 * 8 + 5)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR9,5)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x1011);	// @ (0x202 * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x1010);	// @ (0x202 * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR9<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x2435);	// @ (0x486 * 8 + 5)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR9,5)
// PMD4<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x1822);	// @ (0x304 * 8 + 2)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD4,2)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x1015);	// @ (0x202 * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x1014);	// @ (0x202 * 8 + 4)
