garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
#define                                 TU16BPS7_bit        _BIT_ACCESS(TU16BPS,7)
// TU16BCON0<TU16BRDSEL>
extern volatile __bit                   TU16BRDSEL          __at(0x9D3);	// @ (0x13A * 8 + 3)
#define                                 TU16BRDSEL_bit      _BIT_ACCESS(TU16BCON0,3)
// TU16BHLT<TU16BRESET0>
extern volatile __bit                   TU16BRESET0         __at(0x9E2);	// @ (0x13C * 8 + 2)
#define                                 TU16BRESET0_bit     _BIT_ACCESS(TU16BHLT,2)
// TU16BHLT<TU16BRESET1>
extern volatile __bit                   TU16BRESET1         __at(0x9E3);	// @ (0x13C * 8 + 3)
#define                                 TU16BRESET1_bit     _BIT_ACCESS(TU16BHLT,3)
// TU16BCON1<TU16BRUN>
extern volatile __bit                   TU16BRUN            __at(0x9DF);	// @ (0x13B * 8 + 7)
#define                                 TU16BRUN_bit        _BIT_ACCESS(TU16BCON1,7)
// TU16BHLT<TU16BSTART0>
extern volatile __bit                   TU16BSTART0         __at(0x9E4);	// @ (0x13C * 8 + 4)
#define                                 TU16BSTART0_bit     _BIT_ACCESS(TU16BHLT,4)
// TU16BHLT<TU16BSTART1>
extern volatile __bit                   TU16BSTART1         __at(0x9E5);	// @ (0x13C * 8 + 5)
#define                                 TU16BSTART1_bit     _BIT_ACCESS(TU16BHLT,5)
// TU16BHLT<TU16BSTOP0>
extern volatile __bit                   TU16BSTOP0          __at(0x9E0);	// @ (0x13C * 8 + 0)
#define                                 TU16BSTOP0_bit      _BIT_ACCESS(TU16BHLT,0)
// TU16BHLT<TU16BSTOP1>
extern volatile __bit                   TU16BSTOP1          __at(0x9E1);	// @ (0x13C * 8 + 1)
#define                                 TU16BSTOP1_bit      _BIT_ACCESS(TU16BHLT,1)
// TU16BTMRL<TU16BTMR0>
extern volatile __bit                   TU16BTMR0           __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BTMR0_bit       _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMR1>
extern volatile __bit                   TU16BTMR1           __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BTMR1_bit       _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRH<TU16BTMR10>
extern volatile __bit                   TU16BTMR10          __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BTMR10_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMR11>
extern volatile __bit                   TU16BTMR11          __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BTMR11_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMR12>
extern volatile __bit                   TU16BTMR12          __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BTMR12_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMR13>
extern volatile __bit                   TU16BTMR13          __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BTMR13_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMR14>
extern volatile __bit                   TU16BTMR14          __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BTMR14_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMR15>
extern volatile __bit                   TU16BTMR15          __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BTMR15_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMR2>
extern volatile __bit                   TU16BTMR2           __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BTMR2_bit       _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRT<TU16BTMR24>
extern volatile __bit                   TU16BTMR24          __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BTMR24_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMR25>
extern volatile __bit                   TU16BTMR25          __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BTMR25_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMR26>
extern volatile __bit                   TU16BTMR26          __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BTMR26_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMR27>
extern volatile __bit                   TU16BTMR27          __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BTMR27_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMR28>
extern volatile __bit                   TU16BTMR28          __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BTMR28_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMR29>
extern volatile __bit                   TU16BTMR29          __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BTMR29_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRL<TU16BTMR3>
extern volatile __bit                   TU16BTMR3           __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BTMR3_bit       _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRT<TU16BTMR30>
extern volatile __bit                   TU16BTMR30          __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BTMR30_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMR31>
extern volatile __bit                   TU16BTMR31          __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BTMR31_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BTMRL<TU16BTMR4>
extern volatile __bit                   TU16BTMR4           __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BTMR4_bit       _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMR5>
extern volatile __bit                   TU16BTMR5           __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BTMR5_bit       _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMR6>
extern volatile __bit                   TU16BTMR6           __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BTMR6_bit       _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMR7>
extern volatile __bit                   TU16BTMR7           __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BTMR7_bit       _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRH<TU16BTMR8>
extern volatile __bit                   TU16BTMR8           __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BTMR8_bit       _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMR9>
extern volatile __bit                   TU16BTMR9           __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BTMR9_bit       _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH0>
extern volatile __bit                   TU16BTMRH0          __at(0x9F8);	// @ (0x13F * 8 + 0)
#define                                 TU16BTMRH0_bit      _BIT_ACCESS(TU16BTMRH,0)
// TU16BTMRH<TU16BTMRH1>
extern volatile __bit                   TU16BTMRH1          __at(0x9F9);	// @ (0x13F * 8 + 1)
#define                                 TU16BTMRH1_bit      _BIT_ACCESS(TU16BTMRH,1)
// TU16BTMRH<TU16BTMRH2>
extern volatile __bit                   TU16BTMRH2          __at(0x9FA);	// @ (0x13F * 8 + 2)
#define                                 TU16BTMRH2_bit      _BIT_ACCESS(TU16BTMRH,2)
// TU16BTMRH<TU16BTMRH3>
extern volatile __bit                   TU16BTMRH3          __at(0x9FB);	// @ (0x13F * 8 + 3)
#define                                 TU16BTMRH3_bit      _BIT_ACCESS(TU16BTMRH,3)
// TU16BTMRH<TU16BTMRH4>
extern volatile __bit                   TU16BTMRH4          __at(0x9FC);	// @ (0x13F * 8 + 4)
#define                                 TU16BTMRH4_bit      _BIT_ACCESS(TU16BTMRH,4)
// TU16BTMRH<TU16BTMRH5>
extern volatile __bit                   TU16BTMRH5          __at(0x9FD);	// @ (0x13F * 8 + 5)
#define                                 TU16BTMRH5_bit      _BIT_ACCESS(TU16BTMRH,5)
// TU16BTMRH<TU16BTMRH6>
extern volatile __bit                   TU16BTMRH6          __at(0x9FE);	// @ (0x13F * 8 + 6)
#define                                 TU16BTMRH6_bit      _BIT_ACCESS(TU16BTMRH,6)
// TU16BTMRH<TU16BTMRH7>
extern volatile __bit                   TU16BTMRH7          __at(0x9FF);	// @ (0x13F * 8 + 7)
#define                                 TU16BTMRH7_bit      _BIT_ACCESS(TU16BTMRH,7)
// TU16BTMRL<TU16BTMRL0>
extern volatile __bit                   TU16BTMRL0          __at(0x9F0);	// @ (0x13E * 8 + 0)
#define                                 TU16BTMRL0_bit      _BIT_ACCESS(TU16BTMRL,0)
// TU16BTMRL<TU16BTMRL1>
extern volatile __bit                   TU16BTMRL1          __at(0x9F1);	// @ (0x13E * 8 + 1)
#define                                 TU16BTMRL1_bit      _BIT_ACCESS(TU16BTMRL,1)
// TU16BTMRL<TU16BTMRL2>
extern volatile __bit                   TU16BTMRL2          __at(0x9F2);	// @ (0x13E * 8 + 2)
#define                                 TU16BTMRL2_bit      _BIT_ACCESS(TU16BTMRL,2)
// TU16BTMRL<TU16BTMRL3>
extern volatile __bit                   TU16BTMRL3          __at(0x9F3);	// @ (0x13E * 8 + 3)
#define                                 TU16BTMRL3_bit      _BIT_ACCESS(TU16BTMRL,3)
// TU16BTMRL<TU16BTMRL4>
extern volatile __bit                   TU16BTMRL4          __at(0x9F4);	// @ (0x13E * 8 + 4)
#define                                 TU16BTMRL4_bit      _BIT_ACCESS(TU16BTMRL,4)
// TU16BTMRL<TU16BTMRL5>
extern volatile __bit                   TU16BTMRL5          __at(0x9F5);	// @ (0x13E * 8 + 5)
#define                                 TU16BTMRL5_bit      _BIT_ACCESS(TU16BTMRL,5)
// TU16BTMRL<TU16BTMRL6>
extern volatile __bit                   TU16BTMRL6          __at(0x9F6);	// @ (0x13E * 8 + 6)
#define                                 TU16BTMRL6_bit      _BIT_ACCESS(TU16BTMRL,6)
// TU16BTMRL<TU16BTMRL7>
extern volatile __bit                   TU16BTMRL7          __at(0x9F7);	// @ (0x13E * 8 + 7)
#define                                 TU16BTMRL7_bit      _BIT_ACCESS(TU16BTMRL,7)
// TU16BTMRT<TU16BTMRT0>
extern volatile __bit                   TU16BTMRT0          __at(0xA08);	// @ (0x141 * 8 + 0)
#define                                 TU16BTMRT0_bit      _BIT_ACCESS(TU16BTMRT,0)
// TU16BTMRT<TU16BTMRT1>
extern volatile __bit                   TU16BTMRT1          __at(0xA09);	// @ (0x141 * 8 + 1)
#define                                 TU16BTMRT1_bit      _BIT_ACCESS(TU16BTMRT,1)
// TU16BTMRT<TU16BTMRT2>
extern volatile __bit                   TU16BTMRT2          __at(0xA0A);	// @ (0x141 * 8 + 2)
#define                                 TU16BTMRT2_bit      _BIT_ACCESS(TU16BTMRT,2)
// TU16BTMRT<TU16BTMRT3>
extern volatile __bit                   TU16BTMRT3          __at(0xA0B);	// @ (0x141 * 8 + 3)
#define                                 TU16BTMRT3_bit      _BIT_ACCESS(TU16BTMRT,3)
// TU16BTMRT<TU16BTMRT4>
extern volatile __bit                   TU16BTMRT4          __at(0xA0C);	// @ (0x141 * 8 + 4)
#define                                 TU16BTMRT4_bit      _BIT_ACCESS(TU16BTMRT,4)
// TU16BTMRT<TU16BTMRT5>
extern volatile __bit                   TU16BTMRT5          __at(0xA0D);	// @ (0x141 * 8 + 5)
#define                                 TU16BTMRT5_bit      _BIT_ACCESS(TU16BTMRT,5)
// TU16BTMRT<TU16BTMRT6>
extern volatile __bit                   TU16BTMRT6          __at(0xA0E);	// @ (0x141 * 8 + 6)
#define                                 TU16BTMRT6_bit      _BIT_ACCESS(TU16BTMRT,6)
// TU16BTMRT<TU16BTMRT7>
extern volatile __bit                   TU16BTMRT7          __at(0xA0F);	// @ (0x141 * 8 + 7)
#define                                 TU16BTMRT7_bit      _BIT_ACCESS(TU16BTMRT,7)
// TU16BCON0<TU16BZIE>
extern volatile __bit                   TU16BZIE            __at(0x9D1);	// @ (0x13A * 8 + 1)
#define                                 TU16BZIE_bit        _BIT_ACCESS(TU16BCON0,1)
// TU16BCON1<TU16BZIF>
extern volatile __bit                   TU16BZIF            __at(0x9D9);	// @ (0x13B * 8 + 1)
#define                                 TU16BZIF_bit        _BIT_ACCESS(TU16BCON1,1)
// TUIN0PPS<TUIN0PPS0>
extern volatile __bit                   TUIN0PPS0           __at(0x1B28);	// @ (0x365 * 8 + 0)
#define                                 TUIN0PPS0_bit       _BIT_ACCESS(TUIN0PPS,0)
// TUIN0PPS<TUIN0PPS1>
extern volatile __bit                   TUIN0PPS1           __at(0x1B29);	// @ (0x365 * 8 + 1)
#define                                 TUIN0PPS1_bit       _BIT_ACCESS(TUIN0PPS,1)
// TUIN0PPS<TUIN0PPS2>
extern volatile __bit                   TUIN0PPS2           __at(0x1B2A);	// @ (0x365 * 8 + 2)
#define                                 TUIN0PPS2_bit       _BIT_ACCESS(TUIN0PPS,2)
// TUIN0PPS<TUIN0PPS3>
extern volatile __bit                   TUIN0PPS3           __at(0x1B2B);	// @ (0x365 * 8 + 3)
#define                                 TUIN0PPS3_bit       _BIT_ACCESS(TUIN0PPS,3)
// TUIN0PPS<TUIN0PPS4>
extern volatile __bit                   TUIN0PPS4           __at(0x1B2C);	// @ (0x365 * 8 + 4)
#define                                 TUIN0PPS4_bit       _BIT_ACCESS(TUIN0PPS,4)
// TUIN1PPS<TUIN1PPS0>
extern volatile __bit                   TUIN1PPS0           __at(0x1B30);	// @ (0x366 * 8 + 0)
#define                                 TUIN1PPS0_bit       _BIT_ACCESS(TUIN1PPS,0)
// TUIN1PPS<TUIN1PPS1>
extern volatile __bit                   TUIN1PPS1           __at(0x1B31);	// @ (0x366 * 8 + 1)
#define                                 TUIN1PPS1_bit       _BIT_ACCESS(TUIN1PPS,1)
// TUIN1PPS<TUIN1PPS2>
extern volatile __bit                   TUIN1PPS2           __at(0x1B32);	// @ (0x366 * 8 + 2)
#define                                 TUIN1PPS2_bit       _BIT_ACCESS(TUIN1PPS,2)
// TUIN1PPS<TUIN1PPS3>
extern volatile __bit                   TUIN1PPS3           __at(0x1B33);	// @ (0x366 * 8 + 3)
#define                                 TUIN1PPS3_bit       _BIT_ACCESS(TUIN1PPS,3)
// TUIN1PPS<TUIN1PPS4>
extern volatile __bit                   TUIN1PPS4           __at(0x1B34);	// @ (0x366 * 8 + 4)
#define                                 TUIN1PPS4_bit       _BIT_ACCESS(TUIN1PPS,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x3F8);	// @ (0x7F * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x3F9);	// @ (0x7F * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x3FA);	// @ (0x7F * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x3FB);	// @ (0x7F * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x3FC);	// @ (0x7F * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x3FD);	// @ (0x7F * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// SPI1TWIDTH<TWIDTH0>
extern volatile __bit                   TWIDTH0             __at(0xEF8);	// @ (0x1DF * 8 + 0)
#define                                 TWIDTH0_bit         _BIT_ACCESS(SPI1TWIDTH,0)
// SPI1TWIDTH<TWIDTH1>
extern volatile __bit                   TWIDTH1             __at(0xEF9);	// @ (0x1DF * 8 + 1)
#define                                 TWIDTH1_bit         _BIT_ACCESS(SPI1TWIDTH,1)
// SPI1TWIDTH<TWIDTH2>
extern volatile __bit                   TWIDTH2             __at(0xEFA);	// @ (0x1DF * 8 + 2)
#define                                 TWIDTH2_bit         _BIT_ACCESS(SPI1TWIDTH,2)
// SPI1TXB<TXB0>
extern volatile __bit                   TXB0                __at(0xEC0);	// @ (0x1D8 * 8 + 0)
#define                                 TXB0_bit            _BIT_ACCESS(SPI1TXB,0)
// SPI1TXB<TXB1>
extern volatile __bit                   TXB1                __at(0xEC1);	// @ (0x1D8 * 8 + 1)
#define                                 TXB1_bit            _BIT_ACCESS(SPI1TXB,1)
// SPI1TXB<TXB2>
extern volatile __bit                   TXB2                __at(0xEC2);	// @ (0x1D8 * 8 + 2)
#define                                 TXB2_bit            _BIT_ACCESS(SPI1TXB,2)
// SPI1TXB<TXB3>
extern volatile __bit                   TXB3                __at(0xEC3);	// @ (0x1D8 * 8 + 3)
#define                                 TXB3_bit            _BIT_ACCESS(SPI1TXB,3)
// SPI1TXB<TXB4>
extern volatile __bit                   TXB4                __at(0xEC4);	// @ (0x1D8 * 8 + 4)
#define                                 TXB4_bit            _BIT_ACCESS(SPI1TXB,4)
// SPI1TXB<TXB5>
extern volatile __bit                   TXB5                __at(0xEC5);	// @ (0x1D8 * 8 + 5)
#define                                 TXB5_bit            _BIT_ACCESS(SPI1TXB,5)
// SPI1TXB<TXB6>
extern volatile __bit                   TXB6                __at(0xEC6);	// @ (0x1D8 * 8 + 6)
#define                                 TXB6_bit            _BIT_ACCESS(SPI1TXB,6)
// SPI1TXB<TXB7>
extern volatile __bit                   TXB7                __at(0xEC7);	// @ (0x1D8 * 8 + 7)
#define                                 TXB7_bit            _BIT_ACCESS(SPI1TXB,7)
// U1ERRIE<TXCIE>
extern volatile __bit                   TXCIE               __at(0xE10);	// @ (0x1C2 * 8 + 0)
#define                                 TXCIE_bit           _BIT_ACCESS(U1ERRIE,0)
// U1ERRIR<TXCIF>
extern volatile __bit                   TXCIF               __at(0xE08);	// @ (0x1C1 * 8 + 0)
#define                                 TXCIF_bit           _BIT_ACCESS(U1ERRIR,0)
// I3C1STAT1<TXFNE>
extern volatile __bit                   TXFNE               __at(0x440);	// @ (0x88 * 8 + 0)
#define                                 TXFNE_bit           _BIT_ACCESS(I3C1STAT1,0)
// SPI1CON2<TXR>
extern volatile __bit                   TXR                 __at(0xEE9);	// @ (0x1DD * 8 + 1)
#define                                 TXR_bit             _BIT_ACCESS(SPI1CON2,1)
// I2C1CON1<TXU>
extern volatile __bit                   TXU                 __at(0xF39);	// @ (0x1E7 * 8 + 1)
#define                                 TXU_bit             _BIT_ACCESS(I2C1CON1,1)
// I3C1ERRIE1<TXWEIE>
extern volatile __bit                   TXWEIE              __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 TXWEIE_bit          _BIT_ACCESS(I3C1ERRIE1,1)
// I3C1ERRIR1<TXWEIF>
extern volatile __bit                   TXWEIF              __at(0x469);	// @ (0x8D * 8 + 1)
#define                                 TXWEIF_bit          _BIT_ACCESS(I3C1ERRIR1,1)
// U1CON0<U1ABDEN>
extern volatile __bit                   U1ABDEN             __at(0xDCE);	// @ (0x1B9 * 8 + 6)
#define                                 U1ABDEN_bit         _BIT_ACCESS(U1CON0,6)
// U1UIR<U1ABDIE>
extern volatile __bit                   U1ABDIE             __at(0xE02);	// @ (0x1C0 * 8 + 2)
#define                                 U1ABDIE_bit         _BIT_ACCESS(U1UIR,2)
// U1UIR<U1ABDIF>
extern volatile __bit                   U1ABDIF             __at(0xE06);	// @ (0x1C0 * 8 + 6)
#define                                 U1ABDIF_bit         _BIT_ACCESS(U1UIR,6)
// U1ERRIE<U1ABDOVE>
extern volatile __bit                   U1ABDOVE            __at(0xE15);	// @ (0x1C2 * 8 + 5)
#define                                 U1ABDOVE_bit        _BIT_ACCESS(U1ERRIE,5)
// U1ERRIR<U1ABDOVF>
extern volatile __bit                   U1ABDOVF            __at(0xE0D);	// @ (0x1C1 * 8 + 5)
#define                                 U1ABDOVF_bit        _BIT_ACCESS(U1ERRIR,5)
// U1CON0<U1BRGS>
extern volatile __bit                   U1BRGS              __at(0xDCF);	// @ (0x1B9 * 8 + 7)
#define                                 U1BRGS_bit          _BIT_ACCESS(U1CON0,7)
// U1CON1<U1BRKOVR>
extern volatile __bit                   U1BRKOVR            __at(0xDD1);	// @ (0x1BA * 8 + 1)
#define                                 U1BRKOVR_bit        _BIT_ACCESS(U1CON1,1)
// U1CON2<U1C0EN>
extern volatile __bit                   U1C0EN              __at(0xDDB);	// @ (0x1BB * 8 + 3)
#define                                 U1C0EN_bit          _BIT_ACCESS(U1CON2,3)
// U1ERRIE<U1CERIE>
extern volatile __bit                   U1CERIE             __at(0xE14);	// @ (0x1C2 * 8 + 4)
#define                                 U1CERIE_bit         _BIT_ACCESS(U1ERRIE,4)
// U1ERRIR<U1CERIF>
extern volatile __bit                   U1CERIF             __at(0xE0C);	// @ (0x1C1 * 8 + 4)
#define                                 U1CERIF_bit         _BIT_ACCESS(U1ERRIR,4)
// U1CTSPPS<U1CTSPPS0>
extern volatile __bit                   U1CTSPPS0           __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 U1CTSPPS0_bit       _BIT_ACCESS(U1CTSPPS,0)
// U1CTSPPS<U1CTSPPS1>
extern volatile __bit                   U1CTSPPS1           __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 U1CTSPPS1_bit       _BIT_ACCESS(U1CTSPPS,1)
// U1CTSPPS<U1CTSPPS2>
extern volatile __bit                   U1CTSPPS2           __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 U1CTSPPS2_bit       _BIT_ACCESS(U1CTSPPS,2)
// U1CTSPPS<U1CTSPPS3>
extern volatile __bit                   U1CTSPPS3           __at(0x1D0B);	// @ (0x3A1 * 8 + 3)
#define                                 U1CTSPPS3_bit       _BIT_ACCESS(U1CTSPPS,3)
// U1CTSPPS<U1CTSPPS4>
extern volatile __bit                   U1CTSPPS4           __at(0x1D0C);	// @ (0x3A1 * 8 + 4)
#define                                 U1CTSPPS4_bit       _BIT_ACCESS(U1CTSPPS,4)
// PIE6<U1EIE>
extern volatile __bit                   U1EIE               __at(0x23CB);	// @ (0x479 * 8 + 3)
#define                                 U1EIE_bit           _BIT_ACCESS(PIE6,3)
// PIR6<U1EIF>
extern volatile __bit                   U1EIF               __at(0x237B);	// @ (0x46F * 8 + 3)
#define                                 U1EIF_bit           _BIT_ACCESS(PIR6,3)
// IPR6<U1EIP>
extern volatile __bit                   U1EIP               __at(0x241B);	// @ (0x483 * 8 + 3)
#define                                 U1EIP_bit           _BIT_ACCESS(IPR6,3)
// U1ERRIE<U1FERIE>
extern volatile __bit                   U1FERIE             __at(0xE13);	// @ (0x1C2 * 8 + 3)
#define                                 U1FERIE_bit         _BIT_ACCESS(U1ERRIE,3)
// U1ERRIR<U1FERIF>
extern volatile __bit                   U1FERIF             __at(0xE0B);	// @ (0x1C1 * 8 + 3)
#define                                 U1FERIF_bit         _BIT_ACCESS(U1ERRIR,3)
// U1CON2<U1FLO0>
extern volatile __bit                   U1FLO0              __at(0xDD8);	// @ (0x1BB * 8 + 0)
#define                                 U1FLO0_bit          _BIT_ACCESS(U1CON2,0)
// U1CON2<U1FLO1>
extern volatile __bit                   U1FLO1              __at(0xDD9);	// @ (0x1BB * 8 + 1)
#define                                 U1FLO1_bit          _BIT_ACCESS(U1CON2,1)
// PIE6<U1IE>
extern volatile __bit                   U1IE                __at(0x23CA);	// @ (0x479 * 8 + 2)
#define                                 U1IE_bit            _BIT_ACCESS(PIE6,2)
// PIR6<U1IF>
extern volatile __bit                   U1IF                __at(0x237A);	// @ (0x46F * 8 + 2)
#define                                 U1IF_bit            _BIT_ACCESS(PIR6,2)
// IPR6<U1IP>
extern volatile __bit                   U1IP                __at(0x241A);	// @ (0x483 * 8 + 2)
#define                                 U1IP_bit            _BIT_ACCESS(IPR6,2)
// PMD3<U1MD>
extern volatile __bit                   U1MD                __at(0x181B);	// @ (0x303 * 8 + 3)
#define                                 U1MD_bit            _BIT_ACCESS(PMD3,3)
// U1CON0<U1MODE0>
extern volatile __bit                   U1MODE0             __at(0xDC8);	// @ (0x1B9 * 8 + 0)
#define                                 U1MODE0_bit         _BIT_ACCESS(U1CON0,0)
// U1CON0<U1MODE1>
extern volatile __bit                   U1MODE1             __at(0xDC9);	// @ (0x1B9 * 8 + 1)
