garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f04q20.h
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x10BC);	// @ (0x217 * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x10BF);	// @ (0x217 * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x10C0);	// @ (0x218 * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x10C1);	// @ (0x218 * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x119E);	// @ (0x233 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// PIE3<VDDIO2IE>
extern volatile __bit                   VDDIO2IE            __at(0x23B2);	// @ (0x476 * 8 + 2)
#define                                 VDDIO2IE_bit        _BIT_ACCESS(PIE3,2)
// PIR3<VDDIO2IF>
extern volatile __bit                   VDDIO2IF            __at(0x2362);	// @ (0x46C * 8 + 2)
#define                                 VDDIO2IF_bit        _BIT_ACCESS(PIR3,2)
// IPR3<VDDIO2IP>
extern volatile __bit                   VDDIO2IP            __at(0x2402);	// @ (0x480 * 8 + 2)
#define                                 VDDIO2IP_bit        _BIT_ACCESS(IPR3,2)
// MVIOSTAT<VDDIO2RDY>
extern volatile __bit                   VDDIO2RDY           __at(0x2530);	// @ (0x4A6 * 8 + 0)
#define                                 VDDIO2RDY_bit       _BIT_ACCESS(MVIOSTAT,0)
// VREGCON<VREGPM0>
extern volatile __bit                   VREGPM0             __at(0x3C8);	// @ (0x79 * 8 + 0)
#define                                 VREGPM0_bit         _BIT_ACCESS(VREGCON,0)
// VREGCON<VREGPM1>
extern volatile __bit                   VREGPM1             __at(0x3C9);	// @ (0x79 * 8 + 1)
#define                                 VREGPM1_bit         _BIT_ACCESS(VREGCON,1)
// I3C1DSTAT1<VRSV0>
extern volatile __bit                   VRSV0               __at(0x558);	// @ (0xAB * 8 + 0)
#define                                 VRSV0_bit           _BIT_ACCESS(I3C1DSTAT1,0)
// I3C1DSTAT1<VRSV1>
extern volatile __bit                   VRSV1               __at(0x559);	// @ (0xAB * 8 + 1)
#define                                 VRSV1_bit           _BIT_ACCESS(I3C1DSTAT1,1)
// I3C1DSTAT1<VRSV2>
extern volatile __bit                   VRSV2               __at(0x55A);	// @ (0xAB * 8 + 2)
#define                                 VRSV2_bit           _BIT_ACCESS(I3C1DSTAT1,2)
// I3C1DSTAT1<VRSV3>
extern volatile __bit                   VRSV3               __at(0x55B);	// @ (0xAB * 8 + 3)
#define                                 VRSV3_bit           _BIT_ACCESS(I3C1DSTAT1,3)
// I3C1DSTAT1<VRSV4>
extern volatile __bit                   VRSV4               __at(0x55C);	// @ (0xAB * 8 + 4)
#define                                 VRSV4_bit           _BIT_ACCESS(I3C1DSTAT1,4)
// I3C1DSTAT1<VRSV5>
extern volatile __bit                   VRSV5               __at(0x55D);	// @ (0xAB * 8 + 5)
#define                                 VRSV5_bit           _BIT_ACCESS(I3C1DSTAT1,5)
// I3C1DSTAT1<VRSV6>
extern volatile __bit                   VRSV6               __at(0x55E);	// @ (0xAB * 8 + 6)
#define                                 VRSV6_bit           _BIT_ACCESS(I3C1DSTAT1,6)
// I3C1DSTAT1<VRSV7>
extern volatile __bit                   VRSV7               __at(0x55F);	// @ (0xAB * 8 + 7)
#define                                 VRSV7_bit           _BIT_ACCESS(I3C1DSTAT1,7)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x3AC);	// @ (0x75 * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x3AD);	// @ (0x75 * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x3AE);	// @ (0x75 * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x3A1);	// @ (0x74 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x3A2);	// @ (0x74 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x3A3);	// @ (0x74 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x3A4);	// @ (0x74 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x3A5);	// @ (0x74 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTTMR<WDTPSCNT16>
extern volatile __bit                   WDTPSCNT16          __at(0x3C0);	// @ (0x78 * 8 + 0)
#define                                 WDTPSCNT16_bit      _BIT_ACCESS(WDTTMR,0)
// WDTTMR<WDTPSCNT17>
extern volatile __bit                   WDTPSCNT17          __at(0x3C1);	// @ (0x78 * 8 + 1)
#define                                 WDTPSCNT17_bit      _BIT_ACCESS(WDTTMR,1)
// WDTCON0<WDTSEN>
extern volatile __bit                   WDTSEN              __at(0x3A0);	// @ (0x74 * 8 + 0)
#define                                 WDTSEN_bit          _BIT_ACCESS(WDTCON0,0)
// WDTTMR<WDTSTATE>
extern volatile __bit                   WDTSTATE            __at(0x3C2);	// @ (0x78 * 8 + 2)
#define                                 WDTSTATE_bit        _BIT_ACCESS(WDTTMR,2)
// WDTTMR<WDTTMR0>
extern volatile __bit                   WDTTMR0             __at(0x3C3);	// @ (0x78 * 8 + 3)
#define                                 WDTTMR0_bit         _BIT_ACCESS(WDTTMR,3)
// WDTTMR<WDTTMR1>
extern volatile __bit                   WDTTMR1             __at(0x3C4);	// @ (0x78 * 8 + 4)
#define                                 WDTTMR1_bit         _BIT_ACCESS(WDTTMR,4)
// WDTTMR<WDTTMR2>
extern volatile __bit                   WDTTMR2             __at(0x3C5);	// @ (0x78 * 8 + 5)
#define                                 WDTTMR2_bit         _BIT_ACCESS(WDTTMR,5)
// WDTTMR<WDTTMR3>
extern volatile __bit                   WDTTMR3             __at(0x3C6);	// @ (0x78 * 8 + 6)
#define                                 WDTTMR3_bit         _BIT_ACCESS(WDTTMR,6)
// WDTTMR<WDTTMR4>
extern volatile __bit                   WDTTMR4             __at(0x3C7);	// @ (0x78 * 8 + 7)
#define                                 WDTTMR4_bit         _BIT_ACCESS(WDTTMR,7)
// WDTCON1<WDTWINDOW0>
extern volatile __bit                   WDTWINDOW0          __at(0x3A8);	// @ (0x75 * 8 + 0)
#define                                 WDTWINDOW0_bit      _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WDTWINDOW1>
extern volatile __bit                   WDTWINDOW1          __at(0x3A9);	// @ (0x75 * 8 + 1)
#define                                 WDTWINDOW1_bit      _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WDTWINDOW2>
extern volatile __bit                   WDTWINDOW2          __at(0x3AA);	// @ (0x75 * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// PCON0<WDTWV>
extern volatile __bit                   WDTWV               __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 WDTWV_bit           _BIT_ACCESS(PCON0,5)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0x3A8);	// @ (0x75 * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0x3A9);	// @ (0x75 * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0x3AA);	// @ (0x75 * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0x20B8);	// @ (0x417 * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0x20B9);	// @ (0x417 * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0x20BA);	// @ (0x417 * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0x20BB);	// @ (0x417 * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0x20BC);	// @ (0x417 * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0x20BD);	// @ (0x417 * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0x2158);	// @ (0x42B * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0x2159);	// @ (0x42B * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0x215B);	// @ (0x42B * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0x215C);	// @ (0x42B * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0x215D);	// @ (0x42B * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0x215E);	// @ (0x42B * 8 + 6)
#define                                 WPUC6_bit           _BIT_ACCESS(WPUC,6)
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0x215F);	// @ (0x42B * 8 + 7)
#define                                 WPUC7_bit           _BIT_ACCESS(WPUC,7)
// I2C1PIE<WR1IE>
extern volatile __bit                   WR1IE               __at(0xF5C);	// @ (0x1EB * 8 + 4)
#define                                 WR1IE_bit           _BIT_ACCESS(I2C1PIE,4)
// I2C1PIR<WR1IF>
extern volatile __bit                   WR1IF               __at(0xF54);	// @ (0x1EA * 8 + 4)
#define                                 WR1IF_bit           _BIT_ACCESS(I2C1PIR,4)
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0x2CF);	// @ (0x59 * 8 + 7)
#define                                 WRERR_bit           _BIT_ACCESS(NVMCON1,7)
// I2C1PIE<WRIE>
extern volatile __bit                   WRIE                __at(0xF5C);	// @ (0x1EB * 8 + 4)
#define                                 WRIE_bit            _BIT_ACCESS(I2C1PIE,4)
// I2C1PIR<WRIF>
extern volatile __bit                   WRIF                __at(0xF54);	// @ (0x1EA * 8 + 4)
#define                                 WRIF_bit            _BIT_ACCESS(I2C1PIR,4)
// DMAnCON0<XIP>
extern volatile __bit                   XIP                 __at(0x2A0);	// @ (0x54 * 8 + 0)
#define                                 XIP_bit             _BIT_ACCESS(DMAnCON0,0)
// CRCXORL<XOR0>
extern volatile __bit                   XOR0                __at(0x320);	// @ (0x64 * 8 + 0)
#define                                 XOR0_bit            _BIT_ACCESS(CRCXORL,0)
// CRCXORL<XOR1>
extern volatile __bit                   XOR1                __at(0x321);	// @ (0x64 * 8 + 1)
#define                                 XOR1_bit            _BIT_ACCESS(CRCXORL,1)
// CRCXORH<XOR10>
extern volatile __bit                   XOR10               __at(0x32A);	// @ (0x65 * 8 + 2)
#define                                 XOR10_bit           _BIT_ACCESS(CRCXORH,2)
// CRCXORH<XOR11>
extern volatile __bit                   XOR11               __at(0x32B);	// @ (0x65 * 8 + 3)
#define                                 XOR11_bit           _BIT_ACCESS(CRCXORH,3)
// CRCXORH<XOR12>
extern volatile __bit                   XOR12               __at(0x32C);	// @ (0x65 * 8 + 4)
#define                                 XOR12_bit           _BIT_ACCESS(CRCXORH,4)
// CRCXORH<XOR13>
extern volatile __bit                   XOR13               __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 XOR13_bit           _BIT_ACCESS(CRCXORH,5)
// CRCXORH<XOR14>
extern volatile __bit                   XOR14               __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 XOR14_bit           _BIT_ACCESS(CRCXORH,6)
// CRCXORH<XOR15>
extern volatile __bit                   XOR15               __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 XOR15_bit           _BIT_ACCESS(CRCXORH,7)
// CRCXORU<XOR16>
extern volatile __bit                   XOR16               __at(0x330);	// @ (0x66 * 8 + 0)
#define                                 XOR16_bit           _BIT_ACCESS(CRCXORU,0)
// CRCXORU<XOR17>
extern volatile __bit                   XOR17               __at(0x331);	// @ (0x66 * 8 + 1)
#define                                 XOR17_bit           _BIT_ACCESS(CRCXORU,1)
// CRCXORU<XOR18>
extern volatile __bit                   XOR18               __at(0x332);	// @ (0x66 * 8 + 2)
#define                                 XOR18_bit           _BIT_ACCESS(CRCXORU,2)
// CRCXORU<XOR19>
extern volatile __bit                   XOR19               __at(0x333);	// @ (0x66 * 8 + 3)
#define                                 XOR19_bit           _BIT_ACCESS(CRCXORU,3)
// CRCXORL<XOR2>
extern volatile __bit                   XOR2                __at(0x322);	// @ (0x64 * 8 + 2)
#define                                 XOR2_bit            _BIT_ACCESS(CRCXORL,2)
// CRCXORU<XOR20>
extern volatile __bit                   XOR20               __at(0x334);	// @ (0x66 * 8 + 4)
#define                                 XOR20_bit           _BIT_ACCESS(CRCXORU,4)
// CRCXORU<XOR21>
extern volatile __bit                   XOR21               __at(0x335);	// @ (0x66 * 8 + 5)
#define                                 XOR21_bit           _BIT_ACCESS(CRCXORU,5)
// CRCXORU<XOR22>
extern volatile __bit                   XOR22               __at(0x336);	// @ (0x66 * 8 + 6)
#define                                 XOR22_bit           _BIT_ACCESS(CRCXORU,6)
// CRCXORU<XOR23>
extern volatile __bit                   XOR23               __at(0x337);	// @ (0x66 * 8 + 7)
#define                                 XOR23_bit           _BIT_ACCESS(CRCXORU,7)
// CRCXORT<XOR24>
extern volatile __bit                   XOR24               __at(0x338);	// @ (0x67 * 8 + 0)
#define                                 XOR24_bit           _BIT_ACCESS(CRCXORT,0)
// CRCXORT<XOR25>
extern volatile __bit                   XOR25               __at(0x339);	// @ (0x67 * 8 + 1)
#define                                 XOR25_bit           _BIT_ACCESS(CRCXORT,1)
// CRCXORT<XOR26>
extern volatile __bit                   XOR26               __at(0x33A);	// @ (0x67 * 8 + 2)
#define                                 XOR26_bit           _BIT_ACCESS(CRCXORT,2)
// CRCXORT<XOR27>
extern volatile __bit                   XOR27               __at(0x33B);	// @ (0x67 * 8 + 3)
#define                                 XOR27_bit           _BIT_ACCESS(CRCXORT,3)
// CRCXORT<XOR28>
extern volatile __bit                   XOR28               __at(0x33C);	// @ (0x67 * 8 + 4)
#define                                 XOR28_bit           _BIT_ACCESS(CRCXORT,4)
// CRCXORT<XOR29>
extern volatile __bit                   XOR29               __at(0x33D);	// @ (0x67 * 8 + 5)
#define                                 XOR29_bit           _BIT_ACCESS(CRCXORT,5)
// CRCXORL<XOR3>
extern volatile __bit                   XOR3                __at(0x323);	// @ (0x64 * 8 + 3)
#define                                 XOR3_bit            _BIT_ACCESS(CRCXORL,3)
// CRCXORT<XOR30>
extern volatile __bit                   XOR30               __at(0x33E);	// @ (0x67 * 8 + 6)
#define                                 XOR30_bit           _BIT_ACCESS(CRCXORT,6)
// CRCXORT<XOR31>
extern volatile __bit                   XOR31               __at(0x33F);	// @ (0x67 * 8 + 7)
#define                                 XOR31_bit           _BIT_ACCESS(CRCXORT,7)
// CRCXORL<XOR4>
extern volatile __bit                   XOR4                __at(0x324);	// @ (0x64 * 8 + 4)
#define                                 XOR4_bit            _BIT_ACCESS(CRCXORL,4)
// CRCXORL<XOR5>
extern volatile __bit                   XOR5                __at(0x325);	// @ (0x64 * 8 + 5)
#define                                 XOR5_bit            _BIT_ACCESS(CRCXORL,5)
// CRCXORL<XOR6>
extern volatile __bit                   XOR6                __at(0x326);	// @ (0x64 * 8 + 6)
#define                                 XOR6_bit            _BIT_ACCESS(CRCXORL,6)
// CRCXORL<XOR7>
extern volatile __bit                   XOR7                __at(0x327);	// @ (0x64 * 8 + 7)
#define                                 XOR7_bit            _BIT_ACCESS(CRCXORL,7)
// CRCXORH<XOR8>
extern volatile __bit                   XOR8                __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 XOR8_bit            _BIT_ACCESS(CRCXORH,0)
// CRCXORH<XOR9>
extern volatile __bit                   XOR9                __at(0x329);	// @ (0x65 * 8 + 1)
#define                                 XOR9_bit            _BIT_ACCESS(CRCXORH,1)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x2780);	// @ (0x4F0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// NVMCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x2C0);	// @ (0x58 * 8 + 0)
#define                                 nDONE_bit           _BIT_ACCESS(NVMCON0,0)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x2781);	// @ (0x4F0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON1<nPORVDDIO2>
extern volatile __bit                   nPORVDDIO2          __at(0x278B);	// @ (0x4F1 * 8 + 3)
#define                                 nPORVDDIO2_bit      _BIT_ACCESS(PCON1,3)
// PCON1<nRCM>
extern volatile __bit                   nRCM                __at(0x2788);	// @ (0x4F1 * 8 + 0)
#define                                 nRCM_bit            _BIT_ACCESS(PCON1,0)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x2782);	// @ (0x4F0 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x2783);	// @ (0x4F0 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON1<nRVREG>
extern volatile __bit                   nRVREG              __at(0x278A);	// @ (0x4F1 * 8 + 2)
#define                                 nRVREG_bit          _BIT_ACCESS(PCON1,2)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x2784);	// @ (0x4F0 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nSYNC>
extern volatile __bit                   nSYNC               __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 nSYNC_bit           _BIT_ACCESS(T1CON,2)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x2785);	// @ (0x4F0 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)

#endif // _PIC18F04Q20_H_
